[
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "Intelligent Shopping Made Simple: The Smart Price Comparison\nAssistant\nTarun Sakthivela, Sabari Krishnana, Jotham Cheeran Emmanuela, Darshana Sasikumara and\nSanskritia\naDepartment of Computer Science and Engineering, VIT AP UNIVERSITY, Amaravathi, Vijayawada, 522241, Andhra Pradesh, India\nA R T I C L E I N F O\nKeywords:\n\" \" Intelligent\nShopping\nMade\nSimple:\nThe\nSmart Price Comparison Assistant\nA B S T R A C T\nIn the era of online shopping, finding the best deals on products can be a daunting tas"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "k. With so\nmany online retailers offering similar products at different prices, it can be time-consuming and\noverwhelming to compare prices across multiple websites manually. That’s where a smart price\ncomparison assistant comes in handy. By utilising AI technology, this assistant can automatically\nsearch and compare prices from various online retailers, saving users time and effort. With\nthe ability to analyse data and identify the best deals, a smart price comparison assistant can\nprovide user"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "s with a comprehensive and unbiased view of the market. This allows users to\nmake informed purchasing decisions and ensures that they are getting the best value for their\nmoney. By utilising AI-driven recommendation engines, this price comparison assistant can not\nonly compare prices but also provide personalised recommendations based on user preferences\nand previous purchases. By using personalised shopping powered by AI, businesses can offer\ntheir customers a unique and tailored experience. Th"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "is personalised experience leads to higher\nengagement, loyalty, and ultimately, increased revenue for businesses. In addition to personalised\nshopping, AI-driven product recommendations also play a significant role in creating engaging\nand personalised online shopping experiences. With the help of AI-powered personalization\ntools, the smart price comparison assistant can analyse user behaviour and preferences to\npersonalise search results and provide relevant and accurate product recommendations"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": ".\n1. Introduction\nIn online shopping, offers unparalleled convenience and endless options, consumers are often faced with the\ndaunting task of navigating through countless retailers and fluctuating prices to find the best deals on their desired\nproducts. Also, people who do shopping through online shopping may miss the major deals or offers of the product\nwhich they are searching for. They didn’t know about the offer since they didn’t go through all the websites or the offers\nthat were running t"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "hrough at that time. The Smart Price Comparison Assistant emerges as a beacon of efficiency and\nintelligence in this bustling digital marketplace.\nThis tool helps in surfing the same product on various websites and then comparing the prices of them and giving\nus the most feasible price on which platform details. With its robust features and intuitive interface, the assistant serves\nas a trusted companion on the journey to finding the perfect product at the best price. By using data aggregation,\n"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "advanced algorithms, and user preferences, it transforms the complex landscape of online retail into a seamless and\nrewarding experience. Moreover, the assistant goes above and beyond to accommodate each user’s particular demands\nand tastes, going above and beyond just comparing prices. It adjusts to different buying patterns with configurable\nsettings and customised recommendations, making sure that every search produces results that cater to the user’s\nparticular preferences and financial limi"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "tations.\nThe Smart Price Comparison Assistant’s capacity to foresee future trends and enhance purchase selections,\nhowever, is what really makes it remarkable. The assistant uses advanced machine learning algorithms to evaluate\nenormous amounts of historical data and forecast price changes. This allows customers to plan their purchases ahead\nof time and take advantage of the best opportunities to make purchases. In essence, the Smart Price Comparison\nAssistant represents a paradigm shift in the "
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "way we approach online shopping— It establishes a new benchmark for\n∗Corresponding author\ntarun.22bce8896@vitapstudent.ac.in (T. Sakthivel); krishnan.22bce8879@vitapstudent.ac.in (S. Krishnan);\nemmanuel.22bce8358@vitapstudent.ac.in (J.C. Emmanuel); darshana.22bec7082@vitapstudent.ac.in (D. Sasikumar);\nsanskriti.22bec7135@vitapstudent.ac.in ( Sanskriti)\nORCID(s):\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 1 of 7\nThe Smart Price Comparison Assistant\nintelligent shopping assistants"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": " with its unmatched efficiency, tailored suggestions, and predictive insights, enabling\nusers to buy more wisely, save time, and discover unmatched value in every transaction.\nThe objective of the system we are developing is to enable results which consist of the details of which platform\nor website has less price of that product and how it varies according to the different offers and deals in the upcoming\nmonths.\n2. Contributions\n• We are making a price comparison model that helps with the pric"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "e comparison between the products on different\nwebsites.\n• The price prediction model is used to predict the cost of the product in the future months and how the cost of\nthe product varies.\n• We implement both models on our website which enables us to provide price comparisons and price trend\npredictions.\n3. Related work\n1. Existing mobile shopping assistance applications provide location-based information about stores and promo-\ntions but lack personalization features. Solutions like LiveCompar"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "e and Citi Shopper offer price comparison\nand card-specific deals but fall short of integrating user preferences effectively. Research efforts have explored\ncontext-based mobile shopping applications, focusing on algorithmic approaches for deal ranking and user inter-\nface design for effective presentation. However, challenges persist in delivering personalised recommendations\nthat cater to individual preferences. Our proposed system, myDeal, addresses these gaps by integrating advanced\nalgorith"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "ms with user-centric design principles. By considering user preferences, location, and payment cards,\nmyDeal delivers tailored recommendations, overcoming the limitations of existing solutions. The key findings\nhighlight the need for improved personalization in mobile shopping assistance, the ongoing research efforts\nin this direction, and the challenges in effectively integrating user preferences. This research aims to provide\nconsumers with a comprehensive mobile shopping application that opti"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "mises deal selection based on individual\npreferences and context [1].\n2. This study reveals significant insights into online consumer decision-making in Taiwan’s tourism sector,\nparticularly emphasising the crucial role of price. Through extensive interviews, it uncovers widespread online\nprice dispersion, especially within travel agencies. Despite this, consumers may not always secure the best offers\nonline, as prices tend to align with those offered by traditional agencies. The research unders"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "cores the timing\nand impact of price throughout the decision-making process, highlighting its pivotal role in both the initial\nfiltering and final evaluation stages. Furthermore, it contributes to marketing theory by exploring the influence\nof price and cultural diversity on consumer attitudes, offering practical implications for managers navigating the\ncompetitive online marketplace [2].\n3. This research sheds light on the evolving landscape of Internet marketing and e-services, emphasising the"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "ir\nstrategic importance for contemporary businesses. It reveals novel insights into online consumer behaviour,\nunderscoring the distinctiveness of traditional markets. Managers demonstrate a keen understanding of consumer\nneeds in the digital realm, effectively harnessing internet capabilities. The study uncovers the interplay between\ninternet development, content, and business strategies, showcasing their pivotal role in driving success. It under-\nscores the necessity for businesses to adopt In"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "ternet marketing strategies, particularly highlighting the authors’\ndiscovery of innovative approaches to e-marketing. Additionally, the research advocates for agile adaptation to\nthe digital sphere, leveraging internet technologies to enhance customer interactions and streamline operations\n[3]. In the landscape of online shopping, recent efforts have centred around enhancing user experiences and\nfacilitating informed purchasing decisions. While previous research has primarily focused on persona"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "lised\nadvertising and leveraging user context for targeted promotions, the proposed work introduces a novel approach\nwith a smart price comparison assistant. Unlike traditional methods, which rely on user preferences and location\ndata, this assistant aims to streamline the process of finding the best deals amidst numerous online retailers and\nfluctuating prices. Leveraging advanced algorithms and machine learning models, it offers features such as price\ncomparison, personalised recommendations, "
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "and price prediction. This innovative system represents a paradigm\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 2 of 7\nThe Smart Price Comparison Assistant\nshift in online shopping assistance, addressing the challenges of price comparison and prediction in a dynamic\ndigital marketplace.\n4. Proposed work\n1. Data Collection and Integration: The first step involves developing web scraping scripts or utilising APIs\nto collect comprehensive product information, including prices, availa"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "bility, and details, from various online\nretailers. The collected data will be integrated into a centralised database or data repository to ensure seamless\naccess and retrieval during the price comparison process.\n2. Price Comparison: The methodology includes systematically navigating through different websites to extract\nproduct prices from various online shopping platforms. Different organising methods will be employed to\ncategorise and structure the collected prices, facilitating efficient co"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "mparison. To manage the substantial volume\nof data, a specialised tool will be developed to streamline data collection and categorization, ensuring systematic\nretrieval from diverse retailers. The tool will aggregate prices from multiple websites and retailers, providing\nusers with a comprehensive comparison to support informed purchasing decisions.\n3. Price Prediction: Leveraging machine learning models, historical price data will be analysed to identify trends\nand patterns in product pricing. "
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "Prediction algorithms will be developed to forecast future price movements based\non historical data, market trends, and other relevant factors. Integration of price prediction capabilities into the\nplatform will empower users with insights into potential price fluctuations, enabling them to make informed\ndecisions and capitalise on favorable pricing trends.\nThe proposed work aims to address the challenges in online shopping by offering a comprehensive platform that\ncombines efficient price compa"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "rison with predictive analytics. Through the integration of advanced technologies\nand methodologies, this research endeavors to provide users with a valuable tool for optimizing their shopping\nexperience and maximizing cost savings.\n5. Methodology\nThis section outlines the methodology of how the flow of the website works. This methodology is split into different\nsections namely,\n• Data Collection and Integration\n– Web scrapping\n– Saving data in the database\n• Price comparison model\n• Price trend"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "s prediction model\n• Website\nThe below mentioned image tells us about how the website works..\n5.1. Data Collection and Integration\n5.1.1. Web Scrapping\n[4]Web scraping involves extracting HTML data from URLs for internal use. Since this is a price comparison\nwebsite, data is scraped from multiple e-commerce sites. For this project, scraping is done using PHP libraries for\nparsing HTML pages. With these libraries, product information from various e-commerce sites is scraped and stored\nin the data"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "base.\n5.1.2. Data Integration\nIntegrate the collected data into a centralised database or data repository for easy access and retrieval during price\ncomparison.\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 3 of 7\nThe Smart Price Comparison Assistant\nFigure 1: Workflow of website\n5.2. Price comparison\n• By using web scraping methods, the website consistently collects pricing information from a wide range of\ne-commerce websites, guaranteeing coverage in multiple product categories. "
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "In order to keep the data current\nand accurate—which is essential for giving users the most recent pricing insights—regular updates are planned.\n• One important part of the process is data aggregation, which involves combining prices for each product from\nseveral sellers. By providing a thorough comparison, this technique enables consumers to make defensible\nconclusions based on compiled data. In order to ensure consistency and dependability in the comparison results,\nalgorithms are used to reco"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "ncile data from various sources. Furthermore, pricing summaries from multiple\nwebsites are produced, allowing consumers to rapidly choose the most affordable options.\n• In order to improve user experience and tool navigation, categorization is essential. Products are divided into\nmany groups according to characteristics like kind, brand, or cost. Product offerings and consumer preferences\nare accommodated via hierarchical classification frameworks, which make browsing and comparison easier.\n• Al"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "gorithms for comparison are created to systematically examine pricing from various vendors. These algorithms\ngive users a comprehensive picture of total costs by accounting for a number of variables, including shipping\ncharges, discounts, and promotions. The goal is to prioritise decision-making simplicity and user experience by\npresenting comparison results in a simple and user-friendly manner.\n• Another important component of the technique is user interface design. Because of the interface’s u"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "ser-friendly\ndesign, exploring categories, conducting product searches, and seeing comparative results are all made simple.\nSorting, filtering, and adjustable preferences are examples of features that improve usability and meet a range of\nuser needs.\n5.3. Price Prediction\n• Price Trends and Predictions Machine Learning Models: Train machine learning models using historical price\ndata to identify price trends and patterns. Prediction Algorithms: Develop algorithms to predict future price\nmovement"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "s based on historical data, market trends, and other relevant factors.\n• A methodical technique to utilising past price data in conjunction with additional market, economic, and\nsentiment variables is the process of building a price prediction model. After careful preparation of the data\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 4 of 7\nThe Smart Price Comparison Assistant\nto deal with anomalies and missing values, feature engineering is carried out to extract useful features th"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "at are\nuseful for modelling. Selecting the right machine learning algorithms, decision trees, or linear validation metrics\nto make sure they are resilient and generalizable using the prepared dataset.\n• In order to precisely predict future price changes, prediction algorithms are then constructed, including sentiment\nresearch and market patterns. Reliability and real-world application are ensured by continuous monitoring\nand deployment into production systems. Validation techniques, such as sens"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "itivity analysis and out-of-sample\ntesting, verify the model’s stability and generalizability in a range of market scenarios.\n• The goal of this thorough approach is to provide an advanced price prediction model that can effectively guide\nonline shopping investments, improve decision-making procedures, and reduce financial risk in situations with\nfluctuating market conditions.\n• Preprocessing techniques are used to clean and standardise the dataset after data collection, taking care of outliers\n"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "and missing values. The next step is feature engineering, which yields useful predictors for the regression model.\nTo do this, lagged variables are created to record temporal dependencies, technical indicators are calculated to\nmeasure market trends, and sentiment features are extracted to evaluate market sentiment.\n• The selection of suitable regression methods for price prediction tasks is the main focus of model development.\nRegression models such as ridge regression, Lasso regression, or lin"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "ear regression are especially appropriate\nbecause pricing data is continuous. Using methods like cross-validation, these models are trained on the prepared\ndataset in order to optimise the model parameters.\n• Model performance is assessed using validation metrics like mean squared error (MSE) or R-squared to make\nsure the selected regression model appropriately depicts price trends and patterns. Furthermore, testing outside\nof the sample is done to evaluate the model’s generalizability to data t"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "hat hasn’t been seen before.\n• The trained regression model is then used as the basis for prediction algorithms, which combine sentiment\nanalysis and market trends to accurately predict future price changes. The model is continuously monitored and\nimproved to guarantee its dependability and efficacy in real-world situations.\n• The goal is to create a reliable and accurate predictive model that may improve investment decision-making\nprocesses and reduce financial risks in dynamic market situation"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "s by using this thorough technique that uses\nregression models for price prediction.\n5.4. Website\n• Our website is intricately designed to offer users thorough insights into product pricing across different\ne-commerce platforms. It utilizes web scraping techniques to gather data and employs an advanced price\ncomparison model to highlight the most economical choices.\n• Our website presents users with a concise summary of the price comparison results, displaying the prices offered\nby different ret"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "ailers in a clear and organised manner. A comparative table or visual chart may be employed to\njuxtapose prices side-by-side, enabling users to quickly discern the most cost-effective option. Additionally, users\nmay have the option to filter and sort results based on various criteria such as price range, retailer reputation, or\nshipping preferences, further enhancing customization and personalization.\n• Users are presented with comprehensive details about each product in the comparison results, "
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "encompassing\nspecifications, features, and images. Additionally, they can access user-generated reviews and ratings, offering\nfurther insights into product performance and customer satisfaction. Direct links to the product pages on relevant\ne-commerce platforms streamline the process from discovering products to making purchases, empowering users\nto make informed decisions effortlessly.\n• The website’s interface is developed using ReactJS framework for the frontend, The backend of the website\nut"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "ilizes Node.js as the server-side runtime environment, allowing developers to write server-side scripts in\nJavaScript for consistent development. Express.js, a web application framework for Node.js is employed to\nstreamline the creation of server-side logic and APIs and for the database the website uses mongodb . To simplify\ninteractions with MongoDB, Mongoose, an Object Data Modeling (ODM) library for MongoDB is used .\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 5 of 7\nThe Smart"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": " Price Comparison Assistant\n6. Result and comparisons:\nModels used\n1. Regression Models: Regression models can be used to predict product prices based on features such as product\nattributes, brand, and historical price data. Techniques like linear regression or ensemble methods such as random\nforests can be effective for this task.\nFigure 2: Working of linear regression\n2. Clustering and Classification: Clustering algorithms can help in grouping similar products together, while\nclassification al"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "gorithms can be used for tasks such as categorising products into different types or identifying\noutliers .\n3. Understanding Regression for Price Prediction using regression:\nRegression analysis is a statistical method used to model the relationship between a dependent variable (in this\ncase, the price of a product) and one or more independent variables (such as product features, brand, and historical\nprice data). In the context of building a price prediction model for a price comparison tool, r"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "egression serves as\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 6 of 7\nThe Smart Price Comparison Assistant\na fundamental technique for estimating the price of a product based on its relevant attributes. The fundamental\nformulae for basic linear regression model is :\n𝑌= 𝛽0 + 𝛽1𝑋+ 𝜀\n(1)\nIn the context of the provided information: Where,\n• 𝑌denotes the dependent variable (price),\n• 𝑋signifies the independent variable (product attribute),\n• 𝛽0 represents the intercept,\n• 𝛽1 denotes "
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "the coefficient of the independent variable,\n• 𝜀symbolises the error term.\n[5] The initial step is to convert raw data into processed data. Which is done by data cleaning since the raw data\ncollected has multiple attributes, but only some of those attributes are needed for the prediction. Then, in feature\nextraction, the data set is divided into two subsets. Training Set and Test Set The training set is used to train a\nmodel, while the testing set is used to test the trained model. After preproc"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "essing, we are going to analyse the\ndata using LSTM and LMS algorithms. Next, we get the output in the form of a report and graph format.\nOnce the regression model is trained on historical data, it is evaluated using various metrics such as Mean\nSquared Error (MSE), Root Mean Squared Error (RMSE), Mean Absolute Error (MAE), or R-squared (R2)\nvalue. These metrics quantify how well the model fits the observed data and how accurately it predicts prices\nfor unseen data.\n7. Conclusion:\nThe emergence "
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "of smart price comparison assistants revolutionises online shopping, offering users efficient access\nto the best deals across multiple retailers. Through AI-driven recommendation engines and data analysis, these\nassistants provide personalised suggestions, empowering users with informed purchasing decisions. Our proposed\nmethodology, encompassing data collection, price comparison, and prediction, ensures the reliability and effectiveness\nof our price comparison assistant. By integrating advanced"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": " techniques such as web scraping and regression models,\nwe enable users to make proactive purchasing decisions based on both current prices and future trends. In essence,\nthe Smart Price Comparison Assistant represents a paradigm shift inconsumer empowerment within the digital\nmarketplace. It not only facilitates immediate price comparisons but also empowers users to anticipate future trends,\nensuring a more efficient and rewarding online shopping experience. Moving forward, our research continu"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "es to drive\nadvancements in e-commerce, placing users at the forefront of the digital marketplace with the tools and insights\nneeded to navigate it with confidence and ease.\nReferences\n[1] C.-Y. C. Chang, Does price matter? how price influences online consumer decision making, Japanese Journal of Administrative Science 22 (3)\n(2009) 245–254.\n[2] H. Terziu, The role of the internet in the development of marketing and electronic services in business, European Journal of Economics and\nBusiness Stud"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "ies (2021).\n[3] K. Muralidharan, S. Gottipati, J. Jiang, N. Ramasubbu, R. K. Balan, mydeal: A mobile shopping assistant matching user preferences\nto promotions, MOBIQUITOUS ’14: Proceedings of the 11th International Conference on Mobile and Ubiquitous Systems: Computing,\nNetworking and Services (2014) 238–247.\n[4] A. Shaikh, R. Khan, K. Panokher, M. Ranjan, V. Sonaje, E-commerce price comparison website using web scraping, International Journal of\nInnovative Research in Engineering & Multidiscip"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "linary Physical Sciences 11 (2023) 1–13. doi:10.37082/IJIRMPS.v11.i3.230223.\n[5] S. Ashika, A. Shet, D. Naik, S. Shetty, R. Kulkarni, Stock price prediction using ml techniques, International Research Journal of Engineering\nand Technology (IRJET) 09 (01) (2022) 1639–1642.\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 7 of 7\n"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "Intelligent Shopping Made Simple: The Smart Price Comparison\nAssistant\nTarun Sakthivela, Sabari Krishnana, Jotham Cheeran Emmanuela, Darshana Sasikumara and\nSanskritia\naDepartment of Computer Science and Engineering, VIT AP UNIVERSITY, Amaravathi, Vijayawada, 522241, Andhra Pradesh, India\nA R T I C L E I N F O\nKeywords:\n\" \" Intelligent\nShopping\nMade\nSimple:\nThe\nSmart Price Comparison Assistant\nA B S T R A C T\nIn the era of online shopping, finding the best deals on products can be a daunting tas"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "k. With so\nmany online retailers offering similar products at different prices, it can be time-consuming and\noverwhelming to compare prices across multiple websites manually. That’s where a smart price\ncomparison assistant comes in handy. By utilising AI technology, this assistant can automatically\nsearch and compare prices from various online retailers, saving users time and effort. With\nthe ability to analyse data and identify the best deals, a smart price comparison assistant can\nprovide user"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s with a comprehensive and unbiased view of the market. This allows users to\nmake informed purchasing decisions and ensures that they are getting the best value for their\nmoney. By utilising AI-driven recommendation engines, this price comparison assistant can not\nonly compare prices but also provide personalised recommendations based on user preferences\nand previous purchases. By using personalised shopping powered by AI, businesses can offer\ntheir customers a unique and tailored experience. Th"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "is personalised experience leads to higher\nengagement, loyalty, and ultimately, increased revenue for businesses. In addition to personalised\nshopping, AI-driven product recommendations also play a significant role in creating engaging\nand personalised online shopping experiences. With the help of AI-powered personalization\ntools, the smart price comparison assistant can analyse user behaviour and preferences to\npersonalise search results and provide relevant and accurate product recommendations"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": ".\n1. Introduction\nIn online shopping, offers unparalleled convenience and endless options, consumers are often faced with the\ndaunting task of navigating through countless retailers and fluctuating prices to find the best deals on their desired\nproducts. Also, people who do shopping through online shopping may miss the major deals or offers of the product\nwhich they are searching for. They didn’t know about the offer since they didn’t go through all the websites or the offers\nthat were running t"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "hrough at that time. The Smart Price Comparison Assistant emerges as a beacon of efficiency and\nintelligence in this bustling digital marketplace.\nThis tool helps in surfing the same product on various websites and then comparing the prices of them and giving\nus the most feasible price on which platform details. With its robust features and intuitive interface, the assistant serves\nas a trusted companion on the journey to finding the perfect product at the best price. By using data aggregation,\n"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "advanced algorithms, and user preferences, it transforms the complex landscape of online retail into a seamless and\nrewarding experience. Moreover, the assistant goes above and beyond to accommodate each user’s particular demands\nand tastes, going above and beyond just comparing prices. It adjusts to different buying patterns with configurable\nsettings and customised recommendations, making sure that every search produces results that cater to the user’s\nparticular preferences and financial limi"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "tations.\nThe Smart Price Comparison Assistant’s capacity to foresee future trends and enhance purchase selections,\nhowever, is what really makes it remarkable. The assistant uses advanced machine learning algorithms to evaluate\nenormous amounts of historical data and forecast price changes. This allows customers to plan their purchases ahead\nof time and take advantage of the best opportunities to make purchases. In essence, the Smart Price Comparison\nAssistant represents a paradigm shift in the "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "way we approach online shopping— It establishes a new benchmark for\n∗Corresponding author\ntarun.22bce8896@vitapstudent.ac.in (T. Sakthivel); krishnan.22bce8879@vitapstudent.ac.in (S. Krishnan);\nemmanuel.22bce8358@vitapstudent.ac.in (J.C. Emmanuel); darshana.22bce7082@vitapstudent.ac.in (D. Sasikumar);\nsanskriti.22bec7135@vitapstudent.ac.in ( Sanskriti)\nORCID(s):\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 1 of 7\nThe Smart Price Comparison Assistant\nintelligent shopping assistants"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": " with its unmatched efficiency, tailored suggestions, and predictive insights, enabling\nusers to buy more wisely, save time, and discover unmatched value in every transaction.\nThe objective of the system we are developing is to enable results which consist of the details of which platform\nor website has less price of that product and how it varies according to the different offers and deals in the upcoming\nmonths.\n2. Contributions\n• We are making a price comparison model that helps with the pric"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "e comparison between the products on different\nwebsites.\n• The price prediction model is used to predict the cost of the product in the future months and how the cost of\nthe product varies.\n• We implement both models on our website which enables us to provide price comparisons and price trend\npredictions.\n3. Related work\n1. Existing mobile shopping assistance applications provide location-based information about stores and promo-\ntions but lack personalization features. Solutions like LiveCompar"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "e and Citi Shopper offer price comparison\nand card-specific deals but fall short of integrating user preferences effectively. Research efforts have explored\ncontext-based mobile shopping applications, focusing on algorithmic approaches for deal ranking and user inter-\nface design for effective presentation. However, challenges persist in delivering personalised recommendations\nthat cater to individual preferences. Our proposed system, myDeal, addresses these gaps by integrating advanced\nalgorith"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ms with user-centric design principles. By considering user preferences, location, and payment cards,\nmyDeal delivers tailored recommendations, overcoming the limitations of existing solutions. The key findings\nhighlight the need for improved personalization in mobile shopping assistance, the ongoing research efforts\nin this direction, and the challenges in effectively integrating user preferences. This research aims to provide\nconsumers with a comprehensive mobile shopping application that opti"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "mises deal selection based on individual\npreferences and context [1].\n2. This study reveals significant insights into online consumer decision-making in Taiwan’s tourism sector,\nparticularly emphasising the crucial role of price. Through extensive interviews, it uncovers widespread online\nprice dispersion, especially within travel agencies. Despite this, consumers may not always secure the best offers\nonline, as prices tend to align with those offered by traditional agencies. The research unders"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "cores the timing\nand impact of price throughout the decision-making process, highlighting its pivotal role in both the initial\nfiltering and final evaluation stages. Furthermore, it contributes to marketing theory by exploring the influence\nof price and cultural diversity on consumer attitudes, offering practical implications for managers navigating the\ncompetitive online marketplace [2].\n3. This research sheds light on the evolving landscape of Internet marketing and e-services, emphasising the"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ir\nstrategic importance for contemporary businesses. It reveals novel insights into online consumer behaviour,\nunderscoring the distinctiveness of traditional markets. Managers demonstrate a keen understanding of consumer\nneeds in the digital realm, effectively harnessing internet capabilities. The study uncovers the interplay between\ninternet development, content, and business strategies, showcasing their pivotal role in driving success. It under-\nscores the necessity for businesses to adopt In"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ternet marketing strategies, particularly highlighting the authors’\ndiscovery of innovative approaches to e-marketing. Additionally, the research advocates for agile adaptation to\nthe digital sphere, leveraging internet technologies to enhance customer interactions and streamline operations\n[3]. In the landscape of online shopping, recent efforts have centred around enhancing user experiences and\nfacilitating informed purchasing decisions. While previous research has primarily focused on persona"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "lised\nadvertising and leveraging user context for targeted promotions, the proposed work introduces a novel approach\nwith a smart price comparison assistant. Unlike traditional methods, which rely on user preferences and location\ndata, this assistant aims to streamline the process of finding the best deals amidst numerous online retailers and\nfluctuating prices. Leveraging advanced algorithms and machine learning models, it offers features such as price\ncomparison, personalised recommendations, "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "and price prediction. This innovative system represents a paradigm\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 2 of 7\nThe Smart Price Comparison Assistant\nshift in online shopping assistance, addressing the challenges of price comparison and prediction in a dynamic\ndigital marketplace.\n4. Proposed work\n1. Data Collection and Integration: The first step involves developing web scraping scripts or utilising APIs\nto collect comprehensive product information, including prices, availa"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "bility, and details, from various online\nretailers. The collected data will be integrated into a centralised database or data repository to ensure seamless\naccess and retrieval during the price comparison process.\n2. Price Comparison: The methodology includes systematically navigating through different websites to extract\nproduct prices from various online shopping platforms. Different organising methods will be employed to\ncategorise and structure the collected prices, facilitating efficient co"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "mparison. To manage the substantial volume\nof data, a specialised tool will be developed to streamline data collection and categorization, ensuring systematic\nretrieval from diverse retailers. The tool will aggregate prices from multiple websites and retailers, providing\nusers with a comprehensive comparison to support informed purchasing decisions.\n3. Price Prediction: Leveraging machine learning models, historical price data will be analysed to identify trends\nand patterns in product pricing. "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "Prediction algorithms will be developed to forecast future price movements based\non historical data, market trends, and other relevant factors. Integration of price prediction capabilities into the\nplatform will empower users with insights into potential price fluctuations, enabling them to make informed\ndecisions and capitalise on favorable pricing trends.\nThe proposed work aims to address the challenges in online shopping by offering a comprehensive platform that\ncombines efficient price compa"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "rison with predictive analytics. Through the integration of advanced technologies\nand methodologies, this research endeavors to provide users with a valuable tool for optimizing their shopping\nexperience and maximizing cost savings.\n5. Methodology\nThis section outlines the methodology of how the flow of the website works. This methodology is split into different\nsections namely,\n• Data Collection and Integration\n– Web scrapping\n– Saving data in the database\n• Price comparison model\n• Price trend"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s prediction model\n• Website\nThe below mentioned image tells us about how the website works..\n5.1. Data Collection and Integration\n5.1.1. Web Scrapping\n[4]Web scraping involves extracting HTML data from URLs for internal use. Since this is a price comparison\nwebsite, data is scraped from multiple e-commerce sites. For this project, scraping is done using PHP libraries for\nparsing HTML pages. With these libraries, product information from various e-commerce sites is scraped and stored\nin the data"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "base.\n5.1.2. Data Integration\nIntegrate the collected data into a centralised database or data repository for easy access and retrieval during price\ncomparison.\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 3 of 7\nThe Smart Price Comparison Assistant\nFigure 1: Workflow of website\n5.2. Price comparison\n• By using web scraping methods, the website consistently collects pricing information from a wide range of\ne-commerce websites, guaranteeing coverage in multiple product categories. "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "In order to keep the data current\nand accurate—which is essential for giving users the most recent pricing insights—regular updates are planned.\n• One important part of the process is data aggregation, which involves combining prices for each product from\nseveral sellers. By providing a thorough comparison, this technique enables consumers to make defensible\nconclusions based on compiled data. In order to ensure consistency and dependability in the comparison results,\nalgorithms are used to reco"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ncile data from various sources. Furthermore, pricing summaries from multiple\nwebsites are produced, allowing consumers to rapidly choose the most affordable options.\n• In order to improve user experience and tool navigation, categorization is essential. Products are divided into\nmany groups according to characteristics like kind, brand, or cost. Product offerings and consumer preferences\nare accommodated via hierarchical classification frameworks, which make browsing and comparison easier.\n• Al"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "gorithms for comparison are created to systematically examine pricing from various vendors. These algorithms\ngive users a comprehensive picture of total costs by accounting for a number of variables, including shipping\ncharges, discounts, and promotions. The goal is to prioritise decision-making simplicity and user experience by\npresenting comparison results in a simple and user-friendly manner.\n• Another important component of the technique is user interface design. Because of the interface’s u"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ser-friendly\ndesign, exploring categories, conducting product searches, and seeing comparative results are all made simple.\nSorting, filtering, and adjustable preferences are examples of features that improve usability and meet a range of\nuser needs.\n5.3. Price Prediction\n• Price Trends and Predictions Machine Learning Models: Train machine learning models using historical price\ndata to identify price trends and patterns. Prediction Algorithms: Develop algorithms to predict future price\nmovement"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s based on historical data, market trends, and other relevant factors.\n• A methodical technique to utilising past price data in conjunction with additional market, economic, and\nsentiment variables is the process of building a price prediction model. After careful preparation of the data\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 4 of 7\nThe Smart Price Comparison Assistant\nto deal with anomalies and missing values, feature engineering is carried out to extract useful features th"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "at are\nuseful for modelling. Selecting the right machine learning algorithms, decision trees, or linear validation metrics\nto make sure they are resilient and generalizable using the prepared dataset.\n• In order to precisely predict future price changes, prediction algorithms are then constructed, including sentiment\nresearch and market patterns. Reliability and real-world application are ensured by continuous monitoring\nand deployment into production systems. Validation techniques, such as sens"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "itivity analysis and out-of-sample\ntesting, verify the model’s stability and generalizability in a range of market scenarios.\n• The goal of this thorough approach is to provide an advanced price prediction model that can effectively guide\nonline shopping investments, improve decision-making procedures, and reduce financial risk in situations with\nfluctuating market conditions.\n• Preprocessing techniques are used to clean and standardise the dataset after data collection, taking care of outliers\n"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "and missing values. The next step is feature engineering, which yields useful predictors for the regression model.\nTo do this, lagged variables are created to record temporal dependencies, technical indicators are calculated to\nmeasure market trends, and sentiment features are extracted to evaluate market sentiment.\n• The selection of suitable regression methods for price prediction tasks is the main focus of model development.\nRegression models such as ridge regression, Lasso regression, or lin"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ear regression are especially appropriate\nbecause pricing data is continuous. Using methods like cross-validation, these models are trained on the prepared\ndataset in order to optimise the model parameters.\n• Model performance is assessed using validation metrics like mean squared error (MSE) or R-squared to make\nsure the selected regression model appropriately depicts price trends and patterns. Furthermore, testing outside\nof the sample is done to evaluate the model’s generalizability to data t"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "hat hasn’t been seen before.\n• The trained regression model is then used as the basis for prediction algorithms, which combine sentiment\nanalysis and market trends to accurately predict future price changes. The model is continuously monitored and\nimproved to guarantee its dependability and efficacy in real-world situations.\n• The goal is to create a reliable and accurate predictive model that may improve investment decision-making\nprocesses and reduce financial risks in dynamic market situation"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s by using this thorough technique that uses\nregression models for price prediction.\n5.4. Website\n• Our website is intricately designed to offer users thorough insights into product pricing across different\ne-commerce platforms. It utilizes web scraping techniques to gather data and employs an advanced price\ncomparison model to highlight the most economical choices.\n• Our website presents users with a concise summary of the price comparison results, displaying the prices offered\nby different ret"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ailers in a clear and organised manner. A comparative table or visual chart may be employed to\njuxtapose prices side-by-side, enabling users to quickly discern the most cost-effective option. Additionally, users\nmay have the option to filter and sort results based on various criteria such as price range, retailer reputation, or\nshipping preferences, further enhancing customization and personalization.\n• Users are presented with comprehensive details about each product in the comparison results, "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "encompassing\nspecifications, features, and images. Additionally, they can access user-generated reviews and ratings, offering\nfurther insights into product performance and customer satisfaction. Direct links to the product pages on relevant\ne-commerce platforms streamline the process from discovering products to making purchases, empowering users\nto make informed decisions effortlessly.\n• The website’s interface is developed using ReactJS framework for the frontend, The backend of the website\nut"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ilizes Node.js as the server-side runtime environment, allowing developers to write server-side scripts in\nJavaScript for consistent development. Express.js, a web application framework for Node.js is employed to\nstreamline the creation of server-side logic and APIs and for the database the website uses mongodb . To simplify\ninteractions with MongoDB, Mongoose, an Object Data Modeling (ODM) library for MongoDB is used .\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 5 of 7\nThe Smart"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": " Price Comparison Assistant\n6. Result and comparisons:\nModels used\n1. Regression Models: Regression models can be used to predict product prices based on features such as product\nattributes, brand, and historical price data. Techniques like linear regression or ensemble methods such as random\nforests can be effective for this task.\nFigure 2: Working of linear regression\n2. Clustering and Classification: Clustering algorithms can help in grouping similar products together, while\nclassification al"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "gorithms can be used for tasks such as categorising products into different types or identifying\noutliers .\n3. Understanding Regression for Price Prediction using regression:\nRegression analysis is a statistical method used to model the relationship between a dependent variable (in this\ncase, the price of a product) and one or more independent variables (such as product features, brand, and historical\nprice data). In the context of building a price prediction model for a price comparison tool, r"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "egression serves as\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 6 of 7\nThe Smart Price Comparison Assistant\na fundamental technique for estimating the price of a product based on its relevant attributes. The fundamental\nformulae for basic linear regression model is :\n𝑌= 𝛽0 + 𝛽1𝑋+ 𝜀\n(1)\nIn the context of the provided information: Where,\n• 𝑌denotes the dependent variable (price),\n• 𝑋signifies the independent variable (product attribute),\n• 𝛽0 represents the intercept,\n• 𝛽1 denotes "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "the coefficient of the independent variable,\n• 𝜀symbolises the error term.\n[5] The initial step is to convert raw data into processed data. Which is done by data cleaning since the raw data\ncollected has multiple attributes, but only some of those attributes are needed for the prediction. Then, in feature\nextraction, the data set is divided into two subsets. Training Set and Test Set The training set is used to train a\nmodel, while the testing set is used to test the trained model. After preproc"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "essing, we are going to analyse the\ndata using LSTM and LMS algorithms. Next, we get the output in the form of a report and graph format.\nOnce the regression model is trained on historical data, it is evaluated using various metrics such as Mean\nSquared Error (MSE), Root Mean Squared Error (RMSE), Mean Absolute Error (MAE), or R-squared (R2)\nvalue. These metrics quantify how well the model fits the observed data and how accurately it predicts prices\nfor unseen data.\n7. Conclusion:\nThe emergence "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "of smart price comparison assistants revolutionises online shopping, offering users efficient access\nto the best deals across multiple retailers. Through AI-driven recommendation engines and data analysis, these\nassistants provide personalised suggestions, empowering users with informed purchasing decisions. Our proposed\nmethodology, encompassing data collection, price comparison, and prediction, ensures the reliability and effectiveness\nof our price comparison assistant. By integrating advanced"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": " techniques such as web scraping and regression models,\nwe enable users to make proactive purchasing decisions based on both current prices and future trends. In essence,\nthe Smart Price Comparison Assistant represents a paradigm shift inconsumer empowerment within the digital\nmarketplace. It not only facilitates immediate price comparisons but also empowers users to anticipate future trends,\nensuring a more efficient and rewarding online shopping experience. Moving forward, our research continu"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "es to drive\nadvancements in e-commerce, placing users at the forefront of the digital marketplace with the tools and insights\nneeded to navigate it with confidence and ease.\nReferences\n[1] C.-Y. C. Chang, Does price matter? how price influences online consumer decision making, Japanese Journal of Administrative Science 22 (3)\n(2009) 245–254.\n[2] H. Terziu, The role of the internet in the development of marketing and electronic services in business, European Journal of Economics and\nBusiness Stud"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ies (2021).\n[3] K. Muralidharan, S. Gottipati, J. Jiang, N. Ramasubbu, R. K. Balan, mydeal: A mobile shopping assistant matching user preferences\nto promotions, MOBIQUITOUS ’14: Proceedings of the 11th International Conference on Mobile and Ubiquitous Systems: Computing,\nNetworking and Services (2014) 238–247.\n[4] A. Shaikh, R. Khan, K. Panokher, M. Ranjan, V. Sonaje, E-commerce price comparison website using web scraping, International Journal of\nInnovative Research in Engineering & Multidiscip"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "linary Physical Sciences 11 (2023) 1–13. doi:10.37082/IJIRMPS.v11.i3.230223.\n[5] S. Ashika, A. Shet, D. Naik, S. Shetty, R. Kulkarni, Stock price prediction using ml techniques, International Research Journal of Engineering\nand Technology (IRJET) 09 (01) (2022) 1639–1642.\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 7 of 7\n"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "Intelligent Shopping Made Simple: The Smart Price Comparison\nAssistant\nTarun Sakthivela, Sabari Krishnana, Jotham Cheeran Emmanuela, Darshana Sasikumara and\nSanskritia\naDepartment of Computer Science and Engineering, VIT AP UNIVERSITY, Amaravathi, Vijayawada, 522241, Andhra Pradesh, India\nA R T I C L E I N F O\nKeywords:\n\" \" Intelligent\nShopping\nMade\nSimple:\nThe\nSmart Price Comparison Assistant\nA B S T R A C T\nIn the era of online shopping, finding the best deals on products can be a daunting tas"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "k. With so\nmany online retailers offering similar products at different prices, it can be time-consuming and\noverwhelming to compare prices across multiple websites manually. That’s where a smart price\ncomparison assistant comes in handy. By utilising AI technology, this assistant can automatically\nsearch and compare prices from various online retailers, saving users time and effort. With\nthe ability to analyse data and identify the best deals, a smart price comparison assistant can\nprovide user"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "s with a comprehensive and unbiased view of the market. This allows users to\nmake informed purchasing decisions and ensures that they are getting the best value for their\nmoney. By utilising AI-driven recommendation engines, this price comparison assistant can not\nonly compare prices but also provide personalised recommendations based on user preferences\nand previous purchases. By using personalised shopping powered by AI, businesses can offer\ntheir customers a unique and tailored experience. Th"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "is personalised experience leads to higher\nengagement, loyalty, and ultimately, increased revenue for businesses. In addition to personalised\nshopping, AI-driven product recommendations also play a significant role in creating engaging\nand personalised online shopping experiences. With the help of AI-powered personalization\ntools, the smart price comparison assistant can analyse user behaviour and preferences to\npersonalise search results and provide relevant and accurate product recommendations"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": ".\n1. Introduction\nIn online shopping, offers unparalleled convenience and endless options, consumers are often faced with the\ndaunting task of navigating through countless retailers and fluctuating prices to find the best deals on their desired\nproducts. Also, people who do shopping through online shopping may miss the major deals or offers of the product\nwhich they are searching for. They didn’t know about the offer since they didn’t go through all the websites or the offers\nthat were running t"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "hrough at that time. The Smart Price Comparison Assistant emerges as a beacon of efficiency and\nintelligence in this bustling digital marketplace.\nThis tool helps in surfing the same product on various websites and then comparing the prices of them and giving\nus the most feasible price on which platform details. With its robust features and intuitive interface, the assistant serves\nas a trusted companion on the journey to finding the perfect product at the best price. By using data aggregation,\n"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "advanced algorithms, and user preferences, it transforms the complex landscape of online retail into a seamless and\nrewarding experience. Moreover, the assistant goes above and beyond to accommodate each user’s particular demands\nand tastes, going above and beyond just comparing prices. It adjusts to different buying patterns with configurable\nsettings and customised recommendations, making sure that every search produces results that cater to the user’s\nparticular preferences and financial limi"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "tations.\nThe Smart Price Comparison Assistant’s capacity to foresee future trends and enhance purchase selections,\nhowever, is what really makes it remarkable. The assistant uses advanced machine learning algorithms to evaluate\nenormous amounts of historical data and forecast price changes. This allows customers to plan their purchases ahead\nof time and take advantage of the best opportunities to make purchases. In essence, the Smart Price Comparison\nAssistant represents a paradigm shift in the "
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "way we approach online shopping— It establishes a new benchmark for\n∗Corresponding author\ntarun.22bce8896@vitapstudent.ac.in (T. Sakthivel); krishnan.22bce8879@vitapstudent.ac.in (S. Krishnan);\nemmanuel.22bce8358@vitapstudent.ac.in (J.C. Emmanuel); darshana.22bec7082@vitapstudent.ac.in (D. Sasikumar);\nsanskriti.22bec7135@vitapstudent.ac.in ( Sanskriti)\nORCID(s):\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 1 of 7\nThe Smart Price Comparison Assistant\nintelligent shopping assistants"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": " with its unmatched efficiency, tailored suggestions, and predictive insights, enabling\nusers to buy more wisely, save time, and discover unmatched value in every transaction.\nThe objective of the system we are developing is to enable results which consist of the details of which platform\nor website has less price of that product and how it varies according to the different offers and deals in the upcoming\nmonths.\n2. Contributions\n• We are making a price comparison model that helps with the pric"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "e comparison between the products on different\nwebsites.\n• The price prediction model is used to predict the cost of the product in the future months and how the cost of\nthe product varies.\n• We implement both models on our website which enables us to provide price comparisons and price trend\npredictions.\n3. Related work\n1. Existing mobile shopping assistance applications provide location-based information about stores and promo-\ntions but lack personalization features. Solutions like LiveCompar"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "e and Citi Shopper offer price comparison\nand card-specific deals but fall short of integrating user preferences effectively. Research efforts have explored\ncontext-based mobile shopping applications, focusing on algorithmic approaches for deal ranking and user inter-\nface design for effective presentation. However, challenges persist in delivering personalised recommendations\nthat cater to individual preferences. Our proposed system, myDeal, addresses these gaps by integrating advanced\nalgorith"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "ms with user-centric design principles. By considering user preferences, location, and payment cards,\nmyDeal delivers tailored recommendations, overcoming the limitations of existing solutions. The key findings\nhighlight the need for improved personalization in mobile shopping assistance, the ongoing research efforts\nin this direction, and the challenges in effectively integrating user preferences. This research aims to provide\nconsumers with a comprehensive mobile shopping application that opti"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "mises deal selection based on individual\npreferences and context [1].\n2. This study reveals significant insights into online consumer decision-making in Taiwan’s tourism sector,\nparticularly emphasising the crucial role of price. Through extensive interviews, it uncovers widespread online\nprice dispersion, especially within travel agencies. Despite this, consumers may not always secure the best offers\nonline, as prices tend to align with those offered by traditional agencies. The research unders"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "cores the timing\nand impact of price throughout the decision-making process, highlighting its pivotal role in both the initial\nfiltering and final evaluation stages. Furthermore, it contributes to marketing theory by exploring the influence\nof price and cultural diversity on consumer attitudes, offering practical implications for managers navigating the\ncompetitive online marketplace [2].\n3. This research sheds light on the evolving landscape of Internet marketing and e-services, emphasising the"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "ir\nstrategic importance for contemporary businesses. It reveals novel insights into online consumer behaviour,\nunderscoring the distinctiveness of traditional markets. Managers demonstrate a keen understanding of consumer\nneeds in the digital realm, effectively harnessing internet capabilities. The study uncovers the interplay between\ninternet development, content, and business strategies, showcasing their pivotal role in driving success. It under-\nscores the necessity for businesses to adopt In"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "ternet marketing strategies, particularly highlighting the authors’\ndiscovery of innovative approaches to e-marketing. Additionally, the research advocates for agile adaptation to\nthe digital sphere, leveraging internet technologies to enhance customer interactions and streamline operations\n[3]. In the landscape of online shopping, recent efforts have centred around enhancing user experiences and\nfacilitating informed purchasing decisions. While previous research has primarily focused on persona"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "lised\nadvertising and leveraging user context for targeted promotions, the proposed work introduces a novel approach\nwith a smart price comparison assistant. Unlike traditional methods, which rely on user preferences and location\ndata, this assistant aims to streamline the process of finding the best deals amidst numerous online retailers and\nfluctuating prices. Leveraging advanced algorithms and machine learning models, it offers features such as price\ncomparison, personalised recommendations, "
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "and price prediction. This innovative system represents a paradigm\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 2 of 7\nThe Smart Price Comparison Assistant\nshift in online shopping assistance, addressing the challenges of price comparison and prediction in a dynamic\ndigital marketplace.\n4. Proposed work\n1. Data Collection and Integration: The first step involves developing web scraping scripts or utilising APIs\nto collect comprehensive product information, including prices, availa"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "bility, and details, from various online\nretailers. The collected data will be integrated into a centralised database or data repository to ensure seamless\naccess and retrieval during the price comparison process.\n2. Price Comparison: The methodology includes systematically navigating through different websites to extract\nproduct prices from various online shopping platforms. Different organising methods will be employed to\ncategorise and structure the collected prices, facilitating efficient co"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "mparison. To manage the substantial volume\nof data, a specialised tool will be developed to streamline data collection and categorization, ensuring systematic\nretrieval from diverse retailers. The tool will aggregate prices from multiple websites and retailers, providing\nusers with a comprehensive comparison to support informed purchasing decisions.\n3. Price Prediction: Leveraging machine learning models, historical price data will be analysed to identify trends\nand patterns in product pricing. "
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "Prediction algorithms will be developed to forecast future price movements based\non historical data, market trends, and other relevant factors. Integration of price prediction capabilities into the\nplatform will empower users with insights into potential price fluctuations, enabling them to make informed\ndecisions and capitalise on favorable pricing trends.\nThe proposed work aims to address the challenges in online shopping by offering a comprehensive platform that\ncombines efficient price compa"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "rison with predictive analytics. Through the integration of advanced technologies\nand methodologies, this research endeavors to provide users with a valuable tool for optimizing their shopping\nexperience and maximizing cost savings.\n5. Methodology\nThis section outlines the methodology of how the flow of the website works. This methodology is split into different\nsections namely,\n• Data Collection and Integration\n– Web scrapping\n– Saving data in the database\n• Price comparison model\n• Price trend"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "s prediction model\n• Website\nThe below mentioned image tells us about how the website works..\n5.1. Data Collection and Integration\n5.1.1. Web Scrapping\n[4]Web scraping involves extracting HTML data from URLs for internal use. Since this is a price comparison\nwebsite, data is scraped from multiple e-commerce sites. For this project, scraping is done using PHP libraries for\nparsing HTML pages. With these libraries, product information from various e-commerce sites is scraped and stored\nin the data"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "base.\n5.1.2. Data Integration\nIntegrate the collected data into a centralised database or data repository for easy access and retrieval during price\ncomparison.\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 3 of 7\nThe Smart Price Comparison Assistant\nFigure 1: Workflow of website\n5.2. Price comparison\n• By using web scraping methods, the website consistently collects pricing information from a wide range of\ne-commerce websites, guaranteeing coverage in multiple product categories. "
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "In order to keep the data current\nand accurate—which is essential for giving users the most recent pricing insights—regular updates are planned.\n• One important part of the process is data aggregation, which involves combining prices for each product from\nseveral sellers. By providing a thorough comparison, this technique enables consumers to make defensible\nconclusions based on compiled data. In order to ensure consistency and dependability in the comparison results,\nalgorithms are used to reco"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "ncile data from various sources. Furthermore, pricing summaries from multiple\nwebsites are produced, allowing consumers to rapidly choose the most affordable options.\n• In order to improve user experience and tool navigation, categorization is essential. Products are divided into\nmany groups according to characteristics like kind, brand, or cost. Product offerings and consumer preferences\nare accommodated via hierarchical classification frameworks, which make browsing and comparison easier.\n• Al"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "gorithms for comparison are created to systematically examine pricing from various vendors. These algorithms\ngive users a comprehensive picture of total costs by accounting for a number of variables, including shipping\ncharges, discounts, and promotions. The goal is to prioritise decision-making simplicity and user experience by\npresenting comparison results in a simple and user-friendly manner.\n• Another important component of the technique is user interface design. Because of the interface’s u"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "ser-friendly\ndesign, exploring categories, conducting product searches, and seeing comparative results are all made simple.\nSorting, filtering, and adjustable preferences are examples of features that improve usability and meet a range of\nuser needs.\n5.3. Price Prediction\n• Price Trends and Predictions Machine Learning Models: Train machine learning models using historical price\ndata to identify price trends and patterns. Prediction Algorithms: Develop algorithms to predict future price\nmovement"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "s based on historical data, market trends, and other relevant factors.\n• A methodical technique to utilising past price data in conjunction with additional market, economic, and\nsentiment variables is the process of building a price prediction model. After careful preparation of the data\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 4 of 7\nThe Smart Price Comparison Assistant\nto deal with anomalies and missing values, feature engineering is carried out to extract useful features th"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "at are\nuseful for modelling. Selecting the right machine learning algorithms, decision trees, or linear validation metrics\nto make sure they are resilient and generalizable using the prepared dataset.\n• In order to precisely predict future price changes, prediction algorithms are then constructed, including sentiment\nresearch and market patterns. Reliability and real-world application are ensured by continuous monitoring\nand deployment into production systems. Validation techniques, such as sens"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "itivity analysis and out-of-sample\ntesting, verify the model’s stability and generalizability in a range of market scenarios.\n• The goal of this thorough approach is to provide an advanced price prediction model that can effectively guide\nonline shopping investments, improve decision-making procedures, and reduce financial risk in situations with\nfluctuating market conditions.\n• Preprocessing techniques are used to clean and standardise the dataset after data collection, taking care of outliers\n"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "and missing values. The next step is feature engineering, which yields useful predictors for the regression model.\nTo do this, lagged variables are created to record temporal dependencies, technical indicators are calculated to\nmeasure market trends, and sentiment features are extracted to evaluate market sentiment.\n• The selection of suitable regression methods for price prediction tasks is the main focus of model development.\nRegression models such as ridge regression, Lasso regression, or lin"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "ear regression are especially appropriate\nbecause pricing data is continuous. Using methods like cross-validation, these models are trained on the prepared\ndataset in order to optimise the model parameters.\n• Model performance is assessed using validation metrics like mean squared error (MSE) or R-squared to make\nsure the selected regression model appropriately depicts price trends and patterns. Furthermore, testing outside\nof the sample is done to evaluate the model’s generalizability to data t"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "hat hasn’t been seen before.\n• The trained regression model is then used as the basis for prediction algorithms, which combine sentiment\nanalysis and market trends to accurately predict future price changes. The model is continuously monitored and\nimproved to guarantee its dependability and efficacy in real-world situations.\n• The goal is to create a reliable and accurate predictive model that may improve investment decision-making\nprocesses and reduce financial risks in dynamic market situation"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "s by using this thorough technique that uses\nregression models for price prediction.\n5.4. Website\n• Our website is intricately designed to offer users thorough insights into product pricing across different\ne-commerce platforms. It utilizes web scraping techniques to gather data and employs an advanced price\ncomparison model to highlight the most economical choices.\n• Our website presents users with a concise summary of the price comparison results, displaying the prices offered\nby different ret"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "ailers in a clear and organised manner. A comparative table or visual chart may be employed to\njuxtapose prices side-by-side, enabling users to quickly discern the most cost-effective option. Additionally, users\nmay have the option to filter and sort results based on various criteria such as price range, retailer reputation, or\nshipping preferences, further enhancing customization and personalization.\n• Users are presented with comprehensive details about each product in the comparison results, "
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "encompassing\nspecifications, features, and images. Additionally, they can access user-generated reviews and ratings, offering\nfurther insights into product performance and customer satisfaction. Direct links to the product pages on relevant\ne-commerce platforms streamline the process from discovering products to making purchases, empowering users\nto make informed decisions effortlessly.\n• The website’s interface is developed using ReactJS framework for the frontend, The backend of the website\nut"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "ilizes Node.js as the server-side runtime environment, allowing developers to write server-side scripts in\nJavaScript for consistent development. Express.js, a web application framework for Node.js is employed to\nstreamline the creation of server-side logic and APIs and for the database the website uses mongodb . To simplify\ninteractions with MongoDB, Mongoose, an Object Data Modeling (ODM) library for MongoDB is used .\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 5 of 7\nThe Smart"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": " Price Comparison Assistant\n6. Result and comparisons:\nModels used\n1. Regression Models: Regression models can be used to predict product prices based on features such as product\nattributes, brand, and historical price data. Techniques like linear regression or ensemble methods such as random\nforests can be effective for this task.\nFigure 2: Working of linear regression\n2. Clustering and Classification: Clustering algorithms can help in grouping similar products together, while\nclassification al"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "gorithms can be used for tasks such as categorising products into different types or identifying\noutliers .\n3. Understanding Regression for Price Prediction using regression:\nRegression analysis is a statistical method used to model the relationship between a dependent variable (in this\ncase, the price of a product) and one or more independent variables (such as product features, brand, and historical\nprice data). In the context of building a price prediction model for a price comparison tool, r"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "egression serves as\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 6 of 7\nThe Smart Price Comparison Assistant\na fundamental technique for estimating the price of a product based on its relevant attributes. The fundamental\nformulae for basic linear regression model is :\n𝑌= 𝛽0 + 𝛽1𝑋+ 𝜀\n(1)\nIn the context of the provided information: Where,\n• 𝑌denotes the dependent variable (price),\n• 𝑋signifies the independent variable (product attribute),\n• 𝛽0 represents the intercept,\n• 𝛽1 denotes "
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "the coefficient of the independent variable,\n• 𝜀symbolises the error term.\n[5] The initial step is to convert raw data into processed data. Which is done by data cleaning since the raw data\ncollected has multiple attributes, but only some of those attributes are needed for the prediction. Then, in feature\nextraction, the data set is divided into two subsets. Training Set and Test Set The training set is used to train a\nmodel, while the testing set is used to test the trained model. After preproc"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "essing, we are going to analyse the\ndata using LSTM and LMS algorithms. Next, we get the output in the form of a report and graph format.\nOnce the regression model is trained on historical data, it is evaluated using various metrics such as Mean\nSquared Error (MSE), Root Mean Squared Error (RMSE), Mean Absolute Error (MAE), or R-squared (R2)\nvalue. These metrics quantify how well the model fits the observed data and how accurately it predicts prices\nfor unseen data.\n7. Conclusion:\nThe emergence "
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "of smart price comparison assistants revolutionises online shopping, offering users efficient access\nto the best deals across multiple retailers. Through AI-driven recommendation engines and data analysis, these\nassistants provide personalised suggestions, empowering users with informed purchasing decisions. Our proposed\nmethodology, encompassing data collection, price comparison, and prediction, ensures the reliability and effectiveness\nof our price comparison assistant. By integrating advanced"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": " techniques such as web scraping and regression models,\nwe enable users to make proactive purchasing decisions based on both current prices and future trends. In essence,\nthe Smart Price Comparison Assistant represents a paradigm shift inconsumer empowerment within the digital\nmarketplace. It not only facilitates immediate price comparisons but also empowers users to anticipate future trends,\nensuring a more efficient and rewarding online shopping experience. Moving forward, our research continu"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "es to drive\nadvancements in e-commerce, placing users at the forefront of the digital marketplace with the tools and insights\nneeded to navigate it with confidence and ease.\nReferences\n[1] C.-Y. C. Chang, Does price matter? how price influences online consumer decision making, Japanese Journal of Administrative Science 22 (3)\n(2009) 245–254.\n[2] H. Terziu, The role of the internet in the development of marketing and electronic services in business, European Journal of Economics and\nBusiness Stud"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "ies (2021).\n[3] K. Muralidharan, S. Gottipati, J. Jiang, N. Ramasubbu, R. K. Balan, mydeal: A mobile shopping assistant matching user preferences\nto promotions, MOBIQUITOUS ’14: Proceedings of the 11th International Conference on Mobile and Ubiquitous Systems: Computing,\nNetworking and Services (2014) 238–247.\n[4] A. Shaikh, R. Khan, K. Panokher, M. Ranjan, V. Sonaje, E-commerce price comparison website using web scraping, International Journal of\nInnovative Research in Engineering & Multidiscip"
  },
  {
    "source_file": "The Smart Price Comparison Assistant.pdf",
    "chunk": "linary Physical Sciences 11 (2023) 1–13. doi:10.37082/IJIRMPS.v11.i3.230223.\n[5] S. Ashika, A. Shet, D. Naik, S. Shetty, R. Kulkarni, Stock price prediction using ml techniques, International Research Journal of Engineering\nand Technology (IRJET) 09 (01) (2022) 1639–1642.\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 7 of 7\n"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "Intelligent Shopping Made Simple: The Smart Price Comparison\nAssistant\nTarun Sakthivela, Sabari Krishnana, Jotham Cheeran Emmanuela, Darshana Sasikumara and\nSanskritia\naDepartment of Computer Science and Engineering, VIT AP UNIVERSITY, Amaravathi, Vijayawada, 522241, Andhra Pradesh, India\nA R T I C L E I N F O\nKeywords:\n\" \" Intelligent\nShopping\nMade\nSimple:\nThe\nSmart Price Comparison Assistant\nA B S T R A C T\nIn the era of online shopping, finding the best deals on products can be a daunting tas"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "k. With so\nmany online retailers offering similar products at different prices, it can be time-consuming and\noverwhelming to compare prices across multiple websites manually. That’s where a smart price\ncomparison assistant comes in handy. By utilising AI technology, this assistant can automatically\nsearch and compare prices from various online retailers, saving users time and effort. With\nthe ability to analyse data and identify the best deals, a smart price comparison assistant can\nprovide user"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s with a comprehensive and unbiased view of the market. This allows users to\nmake informed purchasing decisions and ensures that they are getting the best value for their\nmoney. By utilising AI-driven recommendation engines, this price comparison assistant can not\nonly compare prices but also provide personalised recommendations based on user preferences\nand previous purchases. By using personalised shopping powered by AI, businesses can offer\ntheir customers a unique and tailored experience. Th"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "is personalised experience leads to higher\nengagement, loyalty, and ultimately, increased revenue for businesses. In addition to personalised\nshopping, AI-driven product recommendations also play a significant role in creating engaging\nand personalised online shopping experiences. With the help of AI-powered personalization\ntools, the smart price comparison assistant can analyse user behaviour and preferences to\npersonalise search results and provide relevant and accurate product recommendations"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": ".\n1. Introduction\nIn online shopping, offers unparalleled convenience and endless options, consumers are often faced with the\ndaunting task of navigating through countless retailers and fluctuating prices to find the best deals on their desired\nproducts. Also, people who do shopping through online shopping may miss the major deals or offers of the product\nwhich they are searching for. They didn’t know about the offer since they didn’t go through all the websites or the offers\nthat were running t"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "hrough at that time. The Smart Price Comparison Assistant emerges as a beacon of efficiency and\nintelligence in this bustling digital marketplace.\nThis tool helps in surfing the same product on various websites and then comparing the prices of them and giving\nus the most feasible price on which platform details. With its robust features and intuitive interface, the assistant serves\nas a trusted companion on the journey to finding the perfect product at the best price. By using data aggregation,\n"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "advanced algorithms, and user preferences, it transforms the complex landscape of online retail into a seamless and\nrewarding experience. Moreover, the assistant goes above and beyond to accommodate each user’s particular demands\nand tastes, going above and beyond just comparing prices. It adjusts to different buying patterns with configurable\nsettings and customised recommendations, making sure that every search produces results that cater to the user’s\nparticular preferences and financial limi"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "tations.\nThe Smart Price Comparison Assistant’s capacity to foresee future trends and enhance purchase selections,\nhowever, is what really makes it remarkable. The assistant uses advanced machine learning algorithms to evaluate\nenormous amounts of historical data and forecast price changes. This allows customers to plan their purchases ahead\nof time and take advantage of the best opportunities to make purchases. In essence, the Smart Price Comparison\nAssistant represents a paradigm shift in the "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "way we approach online shopping— It establishes a new benchmark for\n∗Corresponding author\ntarun.22bce8896@vitapstudent.ac.in (T. Sakthivel); krishnan.22bce8879@vitapstudent.ac.in (S. Krishnan);\nemmanuel.22bce8358@vitapstudent.ac.in (J.C. Emmanuel); darshana.22bce7082@vitapstudent.ac.in (D. Sasikumar);\nsanskriti.22bec7135@vitapstudent.ac.in ( Sanskriti)\nORCID(s):\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 1 of 7\nThe Smart Price Comparison Assistant\nintelligent shopping assistants"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": " with its unmatched efficiency, tailored suggestions, and predictive insights, enabling\nusers to buy more wisely, save time, and discover unmatched value in every transaction.\nThe objective of the system we are developing is to enable results which consist of the details of which platform\nor website has less price of that product and how it varies according to the different offers and deals in the upcoming\nmonths.\n2. Contributions\n• We are making a price comparison model that helps with the pric"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "e comparison between the products on different\nwebsites.\n• The price prediction model is used to predict the cost of the product in the future months and how the cost of\nthe product varies.\n• We implement both models on our website which enables us to provide price comparisons and price trend\npredictions.\n3. Related work\n1. Existing mobile shopping assistance applications provide location-based information about stores and promo-\ntions but lack personalization features. Solutions like LiveCompar"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "e and Citi Shopper offer price comparison\nand card-specific deals but fall short of integrating user preferences effectively. Research efforts have explored\ncontext-based mobile shopping applications, focusing on algorithmic approaches for deal ranking and user inter-\nface design for effective presentation. However, challenges persist in delivering personalised recommendations\nthat cater to individual preferences. Our proposed system, myDeal, addresses these gaps by integrating advanced\nalgorith"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ms with user-centric design principles. By considering user preferences, location, and payment cards,\nmyDeal delivers tailored recommendations, overcoming the limitations of existing solutions. The key findings\nhighlight the need for improved personalization in mobile shopping assistance, the ongoing research efforts\nin this direction, and the challenges in effectively integrating user preferences. This research aims to provide\nconsumers with a comprehensive mobile shopping application that opti"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "mises deal selection based on individual\npreferences and context [1].\n2. This study reveals significant insights into online consumer decision-making in Taiwan’s tourism sector,\nparticularly emphasising the crucial role of price. Through extensive interviews, it uncovers widespread online\nprice dispersion, especially within travel agencies. Despite this, consumers may not always secure the best offers\nonline, as prices tend to align with those offered by traditional agencies. The research unders"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "cores the timing\nand impact of price throughout the decision-making process, highlighting its pivotal role in both the initial\nfiltering and final evaluation stages. Furthermore, it contributes to marketing theory by exploring the influence\nof price and cultural diversity on consumer attitudes, offering practical implications for managers navigating the\ncompetitive online marketplace [2].\n3. This research sheds light on the evolving landscape of Internet marketing and e-services, emphasising the"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ir\nstrategic importance for contemporary businesses. It reveals novel insights into online consumer behaviour,\nunderscoring the distinctiveness of traditional markets. Managers demonstrate a keen understanding of consumer\nneeds in the digital realm, effectively harnessing internet capabilities. The study uncovers the interplay between\ninternet development, content, and business strategies, showcasing their pivotal role in driving success. It under-\nscores the necessity for businesses to adopt In"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ternet marketing strategies, particularly highlighting the authors’\ndiscovery of innovative approaches to e-marketing. Additionally, the research advocates for agile adaptation to\nthe digital sphere, leveraging internet technologies to enhance customer interactions and streamline operations\n[3]. In the landscape of online shopping, recent efforts have centred around enhancing user experiences and\nfacilitating informed purchasing decisions. While previous research has primarily focused on persona"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "lised\nadvertising and leveraging user context for targeted promotions, the proposed work introduces a novel approach\nwith a smart price comparison assistant. Unlike traditional methods, which rely on user preferences and location\ndata, this assistant aims to streamline the process of finding the best deals amidst numerous online retailers and\nfluctuating prices. Leveraging advanced algorithms and machine learning models, it offers features such as price\ncomparison, personalised recommendations, "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "and price prediction. This innovative system represents a paradigm\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 2 of 7\nThe Smart Price Comparison Assistant\nshift in online shopping assistance, addressing the challenges of price comparison and prediction in a dynamic\ndigital marketplace.\n4. Proposed work\n1. Data Collection and Integration: The first step involves developing web scraping scripts or utilising APIs\nto collect comprehensive product information, including prices, availa"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "bility, and details, from various online\nretailers. The collected data will be integrated into a centralised database or data repository to ensure seamless\naccess and retrieval during the price comparison process.\n2. Price Comparison: The methodology includes systematically navigating through different websites to extract\nproduct prices from various online shopping platforms. Different organising methods will be employed to\ncategorise and structure the collected prices, facilitating efficient co"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "mparison. To manage the substantial volume\nof data, a specialised tool will be developed to streamline data collection and categorization, ensuring systematic\nretrieval from diverse retailers. The tool will aggregate prices from multiple websites and retailers, providing\nusers with a comprehensive comparison to support informed purchasing decisions.\n3. Price Prediction: Leveraging machine learning models, historical price data will be analysed to identify trends\nand patterns in product pricing. "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "Prediction algorithms will be developed to forecast future price movements based\non historical data, market trends, and other relevant factors. Integration of price prediction capabilities into the\nplatform will empower users with insights into potential price fluctuations, enabling them to make informed\ndecisions and capitalise on favorable pricing trends.\nThe proposed work aims to address the challenges in online shopping by offering a comprehensive platform that\ncombines efficient price compa"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "rison with predictive analytics. Through the integration of advanced technologies\nand methodologies, this research endeavors to provide users with a valuable tool for optimizing their shopping\nexperience and maximizing cost savings.\n5. Methodology\nThis section outlines the methodology of how the flow of the website works. This methodology is split into different\nsections namely,\n• Data Collection and Integration\n– Web scrapping\n– Saving data in the database\n• Price comparison model\n• Price trend"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s prediction model\n• Website\nThe below mentioned image tells us about how the website works..\n5.1. Data Collection and Integration\n5.1.1. Web Scrapping\n[4]Web scraping involves extracting HTML data from URLs for internal use. Since this is a price comparison\nwebsite, data is scraped from multiple e-commerce sites. For this project, scraping is done using PHP libraries for\nparsing HTML pages. With these libraries, product information from various e-commerce sites is scraped and stored\nin the data"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "base.\n5.1.2. Data Integration\nIntegrate the collected data into a centralised database or data repository for easy access and retrieval during price\ncomparison.\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 3 of 7\nThe Smart Price Comparison Assistant\nFigure 1: Workflow of website\n5.2. Price comparison\n• By using web scraping methods, the website consistently collects pricing information from a wide range of\ne-commerce websites, guaranteeing coverage in multiple product categories. "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "In order to keep the data current\nand accurate—which is essential for giving users the most recent pricing insights—regular updates are planned.\n• One important part of the process is data aggregation, which involves combining prices for each product from\nseveral sellers. By providing a thorough comparison, this technique enables consumers to make defensible\nconclusions based on compiled data. In order to ensure consistency and dependability in the comparison results,\nalgorithms are used to reco"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ncile data from various sources. Furthermore, pricing summaries from multiple\nwebsites are produced, allowing consumers to rapidly choose the most affordable options.\n• In order to improve user experience and tool navigation, categorization is essential. Products are divided into\nmany groups according to characteristics like kind, brand, or cost. Product offerings and consumer preferences\nare accommodated via hierarchical classification frameworks, which make browsing and comparison easier.\n• Al"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "gorithms for comparison are created to systematically examine pricing from various vendors. These algorithms\ngive users a comprehensive picture of total costs by accounting for a number of variables, including shipping\ncharges, discounts, and promotions. The goal is to prioritise decision-making simplicity and user experience by\npresenting comparison results in a simple and user-friendly manner.\n• Another important component of the technique is user interface design. Because of the interface’s u"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ser-friendly\ndesign, exploring categories, conducting product searches, and seeing comparative results are all made simple.\nSorting, filtering, and adjustable preferences are examples of features that improve usability and meet a range of\nuser needs.\n5.3. Price Prediction\n• Price Trends and Predictions Machine Learning Models: Train machine learning models using historical price\ndata to identify price trends and patterns. Prediction Algorithms: Develop algorithms to predict future price\nmovement"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s based on historical data, market trends, and other relevant factors.\n• A methodical technique to utilising past price data in conjunction with additional market, economic, and\nsentiment variables is the process of building a price prediction model. After careful preparation of the data\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 4 of 7\nThe Smart Price Comparison Assistant\nto deal with anomalies and missing values, feature engineering is carried out to extract useful features th"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "at are\nuseful for modelling. Selecting the right machine learning algorithms, decision trees, or linear validation metrics\nto make sure they are resilient and generalizable using the prepared dataset.\n• In order to precisely predict future price changes, prediction algorithms are then constructed, including sentiment\nresearch and market patterns. Reliability and real-world application are ensured by continuous monitoring\nand deployment into production systems. Validation techniques, such as sens"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "itivity analysis and out-of-sample\ntesting, verify the model’s stability and generalizability in a range of market scenarios.\n• The goal of this thorough approach is to provide an advanced price prediction model that can effectively guide\nonline shopping investments, improve decision-making procedures, and reduce financial risk in situations with\nfluctuating market conditions.\n• Preprocessing techniques are used to clean and standardise the dataset after data collection, taking care of outliers\n"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "and missing values. The next step is feature engineering, which yields useful predictors for the regression model.\nTo do this, lagged variables are created to record temporal dependencies, technical indicators are calculated to\nmeasure market trends, and sentiment features are extracted to evaluate market sentiment.\n• The selection of suitable regression methods for price prediction tasks is the main focus of model development.\nRegression models such as ridge regression, Lasso regression, or lin"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ear regression are especially appropriate\nbecause pricing data is continuous. Using methods like cross-validation, these models are trained on the prepared\ndataset in order to optimise the model parameters.\n• Model performance is assessed using validation metrics like mean squared error (MSE) or R-squared to make\nsure the selected regression model appropriately depicts price trends and patterns. Furthermore, testing outside\nof the sample is done to evaluate the model’s generalizability to data t"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "hat hasn’t been seen before.\n• The trained regression model is then used as the basis for prediction algorithms, which combine sentiment\nanalysis and market trends to accurately predict future price changes. The model is continuously monitored and\nimproved to guarantee its dependability and efficacy in real-world situations.\n• The goal is to create a reliable and accurate predictive model that may improve investment decision-making\nprocesses and reduce financial risks in dynamic market situation"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s by using this thorough technique that uses\nregression models for price prediction.\n5.4. Website\n• Our website is intricately designed to offer users thorough insights into product pricing across different\ne-commerce platforms. It utilizes web scraping techniques to gather data and employs an advanced price\ncomparison model to highlight the most economical choices.\n• Our website presents users with a concise summary of the price comparison results, displaying the prices offered\nby different ret"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ailers in a clear and organised manner. A comparative table or visual chart may be employed to\njuxtapose prices side-by-side, enabling users to quickly discern the most cost-effective option. Additionally, users\nmay have the option to filter and sort results based on various criteria such as price range, retailer reputation, or\nshipping preferences, further enhancing customization and personalization.\n• Users are presented with comprehensive details about each product in the comparison results, "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "encompassing\nspecifications, features, and images. Additionally, they can access user-generated reviews and ratings, offering\nfurther insights into product performance and customer satisfaction. Direct links to the product pages on relevant\ne-commerce platforms streamline the process from discovering products to making purchases, empowering users\nto make informed decisions effortlessly.\n• The website’s interface is developed using ReactJS framework for the frontend, The backend of the website\nut"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ilizes Node.js as the server-side runtime environment, allowing developers to write server-side scripts in\nJavaScript for consistent development. Express.js, a web application framework for Node.js is employed to\nstreamline the creation of server-side logic and APIs and for the database the website uses mongodb . To simplify\ninteractions with MongoDB, Mongoose, an Object Data Modeling (ODM) library for MongoDB is used .\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 5 of 7\nThe Smart"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": " Price Comparison Assistant\n6. Result and comparisons:\nModels used\n1. Regression Models: Regression models can be used to predict product prices based on features such as product\nattributes, brand, and historical price data. Techniques like linear regression or ensemble methods such as random\nforests can be effective for this task.\nFigure 2: Working of linear regression\n2. Clustering and Classification: Clustering algorithms can help in grouping similar products together, while\nclassification al"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "gorithms can be used for tasks such as categorising products into different types or identifying\noutliers .\n3. Understanding Regression for Price Prediction using regression:\nRegression analysis is a statistical method used to model the relationship between a dependent variable (in this\ncase, the price of a product) and one or more independent variables (such as product features, brand, and historical\nprice data). In the context of building a price prediction model for a price comparison tool, r"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "egression serves as\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 6 of 7\nThe Smart Price Comparison Assistant\na fundamental technique for estimating the price of a product based on its relevant attributes. The fundamental\nformulae for basic linear regression model is :\n𝑌= 𝛽0 + 𝛽1𝑋+ 𝜀\n(1)\nIn the context of the provided information: Where,\n• 𝑌denotes the dependent variable (price),\n• 𝑋signifies the independent variable (product attribute),\n• 𝛽0 represents the intercept,\n• 𝛽1 denotes "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "the coefficient of the independent variable,\n• 𝜀symbolises the error term.\n[5] The initial step is to convert raw data into processed data. Which is done by data cleaning since the raw data\ncollected has multiple attributes, but only some of those attributes are needed for the prediction. Then, in feature\nextraction, the data set is divided into two subsets. Training Set and Test Set The training set is used to train a\nmodel, while the testing set is used to test the trained model. After preproc"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "essing, we are going to analyse the\ndata using LSTM and LMS algorithms. Next, we get the output in the form of a report and graph format.\nOnce the regression model is trained on historical data, it is evaluated using various metrics such as Mean\nSquared Error (MSE), Root Mean Squared Error (RMSE), Mean Absolute Error (MAE), or R-squared (R2)\nvalue. These metrics quantify how well the model fits the observed data and how accurately it predicts prices\nfor unseen data.\n7. Conclusion:\nThe emergence "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "of smart price comparison assistants revolutionises online shopping, offering users efficient access\nto the best deals across multiple retailers. Through AI-driven recommendation engines and data analysis, these\nassistants provide personalised suggestions, empowering users with informed purchasing decisions. Our proposed\nmethodology, encompassing data collection, price comparison, and prediction, ensures the reliability and effectiveness\nof our price comparison assistant. By integrating advanced"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": " techniques such as web scraping and regression models,\nwe enable users to make proactive purchasing decisions based on both current prices and future trends. In essence,\nthe Smart Price Comparison Assistant represents a paradigm shift inconsumer empowerment within the digital\nmarketplace. It not only facilitates immediate price comparisons but also empowers users to anticipate future trends,\nensuring a more efficient and rewarding online shopping experience. Moving forward, our research continu"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "es to drive\nadvancements in e-commerce, placing users at the forefront of the digital marketplace with the tools and insights\nneeded to navigate it with confidence and ease.\nReferences\n[1] C.-Y. C. Chang, Does price matter? how price influences online consumer decision making, Japanese Journal of Administrative Science 22 (3)\n(2009) 245–254.\n[2] H. Terziu, The role of the internet in the development of marketing and electronic services in business, European Journal of Economics and\nBusiness Stud"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ies (2021).\n[3] K. Muralidharan, S. Gottipati, J. Jiang, N. Ramasubbu, R. K. Balan, mydeal: A mobile shopping assistant matching user preferences\nto promotions, MOBIQUITOUS ’14: Proceedings of the 11th International Conference on Mobile and Ubiquitous Systems: Computing,\nNetworking and Services (2014) 238–247.\n[4] A. Shaikh, R. Khan, K. Panokher, M. Ranjan, V. Sonaje, E-commerce price comparison website using web scraping, International Journal of\nInnovative Research in Engineering & Multidiscip"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "linary Physical Sciences 11 (2023) 1–13. doi:10.37082/IJIRMPS.v11.i3.230223.\n[5] S. Ashika, A. Shet, D. Naik, S. Shetty, R. Kulkarni, Stock price prediction using ml techniques, International Research Journal of Engineering\nand Technology (IRJET) 09 (01) (2022) 1639–1642.\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 7 of 7\n"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "Intelligent Shopping Made Simple: The Smart Price Comparison\nAssistant\nTarun Sakthivela, Sabari Krishnana, Jotham Cheeran Emmanuela, Darshana Sasikumara and\nSanskritia\naDepartment of Computer Science and Engineering, VIT AP UNIVERSITY, Amaravathi, Vijayawada, 522241, Andhra Pradesh, India\nA R T I C L E I N F O\nKeywords:\n\" \" Intelligent\nShopping\nMade\nSimple:\nThe\nSmart Price Comparison Assistant\nA B S T R A C T\nIn the era of online shopping, finding the best deals on products can be a daunting tas"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "k. With so\nmany online retailers offering similar products at different prices, it can be time-consuming and\noverwhelming to compare prices across multiple websites manually. That’s where a smart price\ncomparison assistant comes in handy. By utilising AI technology, this assistant can automatically\nsearch and compare prices from various online retailers, saving users time and effort. With\nthe ability to analyse data and identify the best deals, a smart price comparison assistant can\nprovide user"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s with a comprehensive and unbiased view of the market. This allows users to\nmake informed purchasing decisions and ensures that they are getting the best value for their\nmoney. By utilising AI-driven recommendation engines, this price comparison assistant can not\nonly compare prices but also provide personalised recommendations based on user preferences\nand previous purchases. By using personalised shopping powered by AI, businesses can offer\ntheir customers a unique and tailored experience. Th"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "is personalised experience leads to higher\nengagement, loyalty, and ultimately, increased revenue for businesses. In addition to personalised\nshopping, AI-driven product recommendations also play a significant role in creating engaging\nand personalised online shopping experiences. With the help of AI-powered personalization\ntools, the smart price comparison assistant can analyse user behaviour and preferences to\npersonalise search results and provide relevant and accurate product recommendations"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": ".\n1. Introduction\nIn online shopping, offers unparalleled convenience and endless options, consumers are often faced with the\ndaunting task of navigating through countless retailers and fluctuating prices to find the best deals on their desired\nproducts. Also, people who do shopping through online shopping may miss the major deals or offers of the product\nwhich they are searching for. They didn’t know about the offer since they didn’t go through all the websites or the offers\nthat were running t"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "hrough at that time. The Smart Price Comparison Assistant emerges as a beacon of efficiency and\nintelligence in this bustling digital marketplace.\nThis tool helps in surfing the same product on various websites and then comparing the prices of them and giving\nus the most feasible price on which platform details. With its robust features and intuitive interface, the assistant serves\nas a trusted companion on the journey to finding the perfect product at the best price. By using data aggregation,\n"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "advanced algorithms, and user preferences, it transforms the complex landscape of online retail into a seamless and\nrewarding experience. Moreover, the assistant goes above and beyond to accommodate each user’s particular demands\nand tastes, going above and beyond just comparing prices. It adjusts to different buying patterns with configurable\nsettings and customised recommendations, making sure that every search produces results that cater to the user’s\nparticular preferences and financial limi"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "tations.\nThe Smart Price Comparison Assistant’s capacity to foresee future trends and enhance purchase selections,\nhowever, is what really makes it remarkable. The assistant uses advanced machine learning algorithms to evaluate\nenormous amounts of historical data and forecast price changes. This allows customers to plan their purchases ahead\nof time and take advantage of the best opportunities to make purchases. In essence, the Smart Price Comparison\nAssistant represents a paradigm shift in the "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "way we approach online shopping— It establishes a new benchmark for\n∗Corresponding author\ntarun.22bce8896@vitapstudent.ac.in (T. Sakthivel); krishnan.22bce8879@vitapstudent.ac.in (S. Krishnan);\nemmanuel.22bce8358@vitapstudent.ac.in (J.C. Emmanuel); darshana.22bce7082@vitapstudent.ac.in (D. Sasikumar);\nsanskriti.22bec7135@vitapstudent.ac.in ( Sanskriti)\nORCID(s):\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 1 of 7\nThe Smart Price Comparison Assistant\nintelligent shopping assistants"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": " with its unmatched efficiency, tailored suggestions, and predictive insights, enabling\nusers to buy more wisely, save time, and discover unmatched value in every transaction.\nThe objective of the system we are developing is to enable results which consist of the details of which platform\nor website has less price of that product and how it varies according to the different offers and deals in the upcoming\nmonths.\n2. Contributions\n• We are making a price comparison model that helps with the pric"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "e comparison between the products on different\nwebsites.\n• The price prediction model is used to predict the cost of the product in the future months and how the cost of\nthe product varies.\n• We implement both models on our website which enables us to provide price comparisons and price trend\npredictions.\n3. Related work\n1. Existing mobile shopping assistance applications provide location-based information about stores and promo-\ntions but lack personalization features. Solutions like LiveCompar"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "e and Citi Shopper offer price comparison\nand card-specific deals but fall short of integrating user preferences effectively. Research efforts have explored\ncontext-based mobile shopping applications, focusing on algorithmic approaches for deal ranking and user inter-\nface design for effective presentation. However, challenges persist in delivering personalised recommendations\nthat cater to individual preferences. Our proposed system, myDeal, addresses these gaps by integrating advanced\nalgorith"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ms with user-centric design principles. By considering user preferences, location, and payment cards,\nmyDeal delivers tailored recommendations, overcoming the limitations of existing solutions. The key findings\nhighlight the need for improved personalization in mobile shopping assistance, the ongoing research efforts\nin this direction, and the challenges in effectively integrating user preferences. This research aims to provide\nconsumers with a comprehensive mobile shopping application that opti"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "mises deal selection based on individual\npreferences and context [1].\n2. This study reveals significant insights into online consumer decision-making in Taiwan’s tourism sector,\nparticularly emphasising the crucial role of price. Through extensive interviews, it uncovers widespread online\nprice dispersion, especially within travel agencies. Despite this, consumers may not always secure the best offers\nonline, as prices tend to align with those offered by traditional agencies. The research unders"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "cores the timing\nand impact of price throughout the decision-making process, highlighting its pivotal role in both the initial\nfiltering and final evaluation stages. Furthermore, it contributes to marketing theory by exploring the influence\nof price and cultural diversity on consumer attitudes, offering practical implications for managers navigating the\ncompetitive online marketplace [2].\n3. This research sheds light on the evolving landscape of Internet marketing and e-services, emphasising the"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ir\nstrategic importance for contemporary businesses. It reveals novel insights into online consumer behaviour,\nunderscoring the distinctiveness of traditional markets. Managers demonstrate a keen understanding of consumer\nneeds in the digital realm, effectively harnessing internet capabilities. The study uncovers the interplay between\ninternet development, content, and business strategies, showcasing their pivotal role in driving success. It under-\nscores the necessity for businesses to adopt In"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ternet marketing strategies, particularly highlighting the authors’\ndiscovery of innovative approaches to e-marketing. Additionally, the research advocates for agile adaptation to\nthe digital sphere, leveraging internet technologies to enhance customer interactions and streamline operations\n[3]. In the landscape of online shopping, recent efforts have centred around enhancing user experiences and\nfacilitating informed purchasing decisions. While previous research has primarily focused on persona"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "lised\nadvertising and leveraging user context for targeted promotions, the proposed work introduces a novel approach\nwith a smart price comparison assistant. Unlike traditional methods, which rely on user preferences and location\ndata, this assistant aims to streamline the process of finding the best deals amidst numerous online retailers and\nfluctuating prices. Leveraging advanced algorithms and machine learning models, it offers features such as price\ncomparison, personalised recommendations, "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "and price prediction. This innovative system represents a paradigm\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 2 of 7\nThe Smart Price Comparison Assistant\nshift in online shopping assistance, addressing the challenges of price comparison and prediction in a dynamic\ndigital marketplace.\n4. Proposed work\n1. Data Collection and Integration: The first step involves developing web scraping scripts or utilising APIs\nto collect comprehensive product information, including prices, availa"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "bility, and details, from various online\nretailers. The collected data will be integrated into a centralised database or data repository to ensure seamless\naccess and retrieval during the price comparison process.\n2. Price Comparison: The methodology includes systematically navigating through different websites to extract\nproduct prices from various online shopping platforms. Different organising methods will be employed to\ncategorise and structure the collected prices, facilitating efficient co"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "mparison. To manage the substantial volume\nof data, a specialised tool will be developed to streamline data collection and categorization, ensuring systematic\nretrieval from diverse retailers. The tool will aggregate prices from multiple websites and retailers, providing\nusers with a comprehensive comparison to support informed purchasing decisions.\n3. Price Prediction: Leveraging machine learning models, historical price data will be analysed to identify trends\nand patterns in product pricing. "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "Prediction algorithms will be developed to forecast future price movements based\non historical data, market trends, and other relevant factors. Integration of price prediction capabilities into the\nplatform will empower users with insights into potential price fluctuations, enabling them to make informed\ndecisions and capitalise on favorable pricing trends.\nThe proposed work aims to address the challenges in online shopping by offering a comprehensive platform that\ncombines efficient price compa"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "rison with predictive analytics. Through the integration of advanced technologies\nand methodologies, this research endeavors to provide users with a valuable tool for optimizing their shopping\nexperience and maximizing cost savings.\n5. Methodology\nThis section outlines the methodology of how the flow of the website works. This methodology is split into different\nsections namely,\n• Data Collection and Integration\n– Web scrapping\n– Saving data in the database\n• Price comparison model\n• Price trend"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s prediction model\n• Website\nThe below mentioned image tells us about how the website works..\n5.1. Data Collection and Integration\n5.1.1. Web Scrapping\n[4]Web scraping involves extracting HTML data from URLs for internal use. Since this is a price comparison\nwebsite, data is scraped from multiple e-commerce sites. For this project, scraping is done using PHP libraries for\nparsing HTML pages. With these libraries, product information from various e-commerce sites is scraped and stored\nin the data"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "base.\n5.1.2. Data Integration\nIntegrate the collected data into a centralised database or data repository for easy access and retrieval during price\ncomparison.\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 3 of 7\nThe Smart Price Comparison Assistant\nFigure 1: Workflow of website\n5.2. Price comparison\n• By using web scraping methods, the website consistently collects pricing information from a wide range of\ne-commerce websites, guaranteeing coverage in multiple product categories. "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "In order to keep the data current\nand accurate—which is essential for giving users the most recent pricing insights—regular updates are planned.\n• One important part of the process is data aggregation, which involves combining prices for each product from\nseveral sellers. By providing a thorough comparison, this technique enables consumers to make defensible\nconclusions based on compiled data. In order to ensure consistency and dependability in the comparison results,\nalgorithms are used to reco"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ncile data from various sources. Furthermore, pricing summaries from multiple\nwebsites are produced, allowing consumers to rapidly choose the most affordable options.\n• In order to improve user experience and tool navigation, categorization is essential. Products are divided into\nmany groups according to characteristics like kind, brand, or cost. Product offerings and consumer preferences\nare accommodated via hierarchical classification frameworks, which make browsing and comparison easier.\n• Al"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "gorithms for comparison are created to systematically examine pricing from various vendors. These algorithms\ngive users a comprehensive picture of total costs by accounting for a number of variables, including shipping\ncharges, discounts, and promotions. The goal is to prioritise decision-making simplicity and user experience by\npresenting comparison results in a simple and user-friendly manner.\n• Another important component of the technique is user interface design. Because of the interface’s u"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ser-friendly\ndesign, exploring categories, conducting product searches, and seeing comparative results are all made simple.\nSorting, filtering, and adjustable preferences are examples of features that improve usability and meet a range of\nuser needs.\n5.3. Price Prediction\n• Price Trends and Predictions Machine Learning Models: Train machine learning models using historical price\ndata to identify price trends and patterns. Prediction Algorithms: Develop algorithms to predict future price\nmovement"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s based on historical data, market trends, and other relevant factors.\n• A methodical technique to utilising past price data in conjunction with additional market, economic, and\nsentiment variables is the process of building a price prediction model. After careful preparation of the data\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 4 of 7\nThe Smart Price Comparison Assistant\nto deal with anomalies and missing values, feature engineering is carried out to extract useful features th"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "at are\nuseful for modelling. Selecting the right machine learning algorithms, decision trees, or linear validation metrics\nto make sure they are resilient and generalizable using the prepared dataset.\n• In order to precisely predict future price changes, prediction algorithms are then constructed, including sentiment\nresearch and market patterns. Reliability and real-world application are ensured by continuous monitoring\nand deployment into production systems. Validation techniques, such as sens"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "itivity analysis and out-of-sample\ntesting, verify the model’s stability and generalizability in a range of market scenarios.\n• The goal of this thorough approach is to provide an advanced price prediction model that can effectively guide\nonline shopping investments, improve decision-making procedures, and reduce financial risk in situations with\nfluctuating market conditions.\n• Preprocessing techniques are used to clean and standardise the dataset after data collection, taking care of outliers\n"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "and missing values. The next step is feature engineering, which yields useful predictors for the regression model.\nTo do this, lagged variables are created to record temporal dependencies, technical indicators are calculated to\nmeasure market trends, and sentiment features are extracted to evaluate market sentiment.\n• The selection of suitable regression methods for price prediction tasks is the main focus of model development.\nRegression models such as ridge regression, Lasso regression, or lin"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ear regression are especially appropriate\nbecause pricing data is continuous. Using methods like cross-validation, these models are trained on the prepared\ndataset in order to optimise the model parameters.\n• Model performance is assessed using validation metrics like mean squared error (MSE) or R-squared to make\nsure the selected regression model appropriately depicts price trends and patterns. Furthermore, testing outside\nof the sample is done to evaluate the model’s generalizability to data t"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "hat hasn’t been seen before.\n• The trained regression model is then used as the basis for prediction algorithms, which combine sentiment\nanalysis and market trends to accurately predict future price changes. The model is continuously monitored and\nimproved to guarantee its dependability and efficacy in real-world situations.\n• The goal is to create a reliable and accurate predictive model that may improve investment decision-making\nprocesses and reduce financial risks in dynamic market situation"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s by using this thorough technique that uses\nregression models for price prediction.\n5.4. Website\n• Our website is intricately designed to offer users thorough insights into product pricing across different\ne-commerce platforms. It utilizes web scraping techniques to gather data and employs an advanced price\ncomparison model to highlight the most economical choices.\n• Our website presents users with a concise summary of the price comparison results, displaying the prices offered\nby different ret"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ailers in a clear and organised manner. A comparative table or visual chart may be employed to\njuxtapose prices side-by-side, enabling users to quickly discern the most cost-effective option. Additionally, users\nmay have the option to filter and sort results based on various criteria such as price range, retailer reputation, or\nshipping preferences, further enhancing customization and personalization.\n• Users are presented with comprehensive details about each product in the comparison results, "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "encompassing\nspecifications, features, and images. Additionally, they can access user-generated reviews and ratings, offering\nfurther insights into product performance and customer satisfaction. Direct links to the product pages on relevant\ne-commerce platforms streamline the process from discovering products to making purchases, empowering users\nto make informed decisions effortlessly.\n• The website’s interface is developed using ReactJS framework for the frontend, The backend of the website\nut"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ilizes Node.js as the server-side runtime environment, allowing developers to write server-side scripts in\nJavaScript for consistent development. Express.js, a web application framework for Node.js is employed to\nstreamline the creation of server-side logic and APIs and for the database the website uses mongodb . To simplify\ninteractions with MongoDB, Mongoose, an Object Data Modeling (ODM) library for MongoDB is used .\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 5 of 7\nThe Smart"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": " Price Comparison Assistant\n6. Result and comparisons:\nModels used\n1. Regression Models: Regression models can be used to predict product prices based on features such as product\nattributes, brand, and historical price data. Techniques like linear regression or ensemble methods such as random\nforests can be effective for this task.\nFigure 2: Working of linear regression\n2. Clustering and Classification: Clustering algorithms can help in grouping similar products together, while\nclassification al"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "gorithms can be used for tasks such as categorising products into different types or identifying\noutliers .\n3. Understanding Regression for Price Prediction using regression:\nRegression analysis is a statistical method used to model the relationship between a dependent variable (in this\ncase, the price of a product) and one or more independent variables (such as product features, brand, and historical\nprice data). In the context of building a price prediction model for a price comparison tool, r"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "egression serves as\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 6 of 7\nThe Smart Price Comparison Assistant\na fundamental technique for estimating the price of a product based on its relevant attributes. The fundamental\nformulae for basic linear regression model is :\n𝑌= 𝛽0 + 𝛽1𝑋+ 𝜀\n(1)\nIn the context of the provided information: Where,\n• 𝑌denotes the dependent variable (price),\n• 𝑋signifies the independent variable (product attribute),\n• 𝛽0 represents the intercept,\n• 𝛽1 denotes "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "the coefficient of the independent variable,\n• 𝜀symbolises the error term.\n[5] The initial step is to convert raw data into processed data. Which is done by data cleaning since the raw data\ncollected has multiple attributes, but only some of those attributes are needed for the prediction. Then, in feature\nextraction, the data set is divided into two subsets. Training Set and Test Set The training set is used to train a\nmodel, while the testing set is used to test the trained model. After preproc"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "essing, we are going to analyse the\ndata using LSTM and LMS algorithms. Next, we get the output in the form of a report and graph format.\nOnce the regression model is trained on historical data, it is evaluated using various metrics such as Mean\nSquared Error (MSE), Root Mean Squared Error (RMSE), Mean Absolute Error (MAE), or R-squared (R2)\nvalue. These metrics quantify how well the model fits the observed data and how accurately it predicts prices\nfor unseen data.\n7. Conclusion:\nThe emergence "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "of smart price comparison assistants revolutionises online shopping, offering users efficient access\nto the best deals across multiple retailers. Through AI-driven recommendation engines and data analysis, these\nassistants provide personalised suggestions, empowering users with informed purchasing decisions. Our proposed\nmethodology, encompassing data collection, price comparison, and prediction, ensures the reliability and effectiveness\nof our price comparison assistant. By integrating advanced"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": " techniques such as web scraping and regression models,\nwe enable users to make proactive purchasing decisions based on both current prices and future trends. In essence,\nthe Smart Price Comparison Assistant represents a paradigm shift inconsumer empowerment within the digital\nmarketplace. It not only facilitates immediate price comparisons but also empowers users to anticipate future trends,\nensuring a more efficient and rewarding online shopping experience. Moving forward, our research continu"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "es to drive\nadvancements in e-commerce, placing users at the forefront of the digital marketplace with the tools and insights\nneeded to navigate it with confidence and ease.\nReferences\n[1] C.-Y. C. Chang, Does price matter? how price influences online consumer decision making, Japanese Journal of Administrative Science 22 (3)\n(2009) 245–254.\n[2] H. Terziu, The role of the internet in the development of marketing and electronic services in business, European Journal of Economics and\nBusiness Stud"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ies (2021).\n[3] K. Muralidharan, S. Gottipati, J. Jiang, N. Ramasubbu, R. K. Balan, mydeal: A mobile shopping assistant matching user preferences\nto promotions, MOBIQUITOUS ’14: Proceedings of the 11th International Conference on Mobile and Ubiquitous Systems: Computing,\nNetworking and Services (2014) 238–247.\n[4] A. Shaikh, R. Khan, K. Panokher, M. Ranjan, V. Sonaje, E-commerce price comparison website using web scraping, International Journal of\nInnovative Research in Engineering & Multidiscip"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "linary Physical Sciences 11 (2023) 1–13. doi:10.37082/IJIRMPS.v11.i3.230223.\n[5] S. Ashika, A. Shet, D. Naik, S. Shetty, R. Kulkarni, Stock price prediction using ml techniques, International Research Journal of Engineering\nand Technology (IRJET) 09 (01) (2022) 1639–1642.\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 7 of 7\n"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "Intelligent Shopping Made Simple: The Smart Price Comparison\nAssistant\nTarun Sakthivela, Sabari Krishnana, Jotham Cheeran Emmanuela, Darshana Sasikumara and\nSanskritia\naDepartment of Computer Science and Engineering, VIT AP UNIVERSITY, Amaravathi, Vijayawada, 522241, Andhra Pradesh, India\nA R T I C L E I N F O\nKeywords:\n\" \" Intelligent\nShopping\nMade\nSimple:\nThe\nSmart Price Comparison Assistant\nA B S T R A C T\nIn the era of online shopping, finding the best deals on products can be a daunting tas"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "k. With so\nmany online retailers offering similar products at different prices, it can be time-consuming and\noverwhelming to compare prices across multiple websites manually. That’s where a smart price\ncomparison assistant comes in handy. By utilising AI technology, this assistant can automatically\nsearch and compare prices from various online retailers, saving users time and effort. With\nthe ability to analyse data and identify the best deals, a smart price comparison assistant can\nprovide user"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s with a comprehensive and unbiased view of the market. This allows users to\nmake informed purchasing decisions and ensures that they are getting the best value for their\nmoney. By utilising AI-driven recommendation engines, this price comparison assistant can not\nonly compare prices but also provide personalised recommendations based on user preferences\nand previous purchases. By using personalised shopping powered by AI, businesses can offer\ntheir customers a unique and tailored experience. Th"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "is personalised experience leads to higher\nengagement, loyalty, and ultimately, increased revenue for businesses. In addition to personalised\nshopping, AI-driven product recommendations also play a significant role in creating engaging\nand personalised online shopping experiences. With the help of AI-powered personalization\ntools, the smart price comparison assistant can analyse user behaviour and preferences to\npersonalise search results and provide relevant and accurate product recommendations"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": ".\n1. Introduction\nIn online shopping, offers unparalleled convenience and endless options, consumers are often faced with the\ndaunting task of navigating through countless retailers and fluctuating prices to find the best deals on their desired\nproducts. Also, people who do shopping through online shopping may miss the major deals or offers of the product\nwhich they are searching for. They didn’t know about the offer since they didn’t go through all the websites or the offers\nthat were running t"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "hrough at that time. The Smart Price Comparison Assistant emerges as a beacon of efficiency and\nintelligence in this bustling digital marketplace.\nThis tool helps in surfing the same product on various websites and then comparing the prices of them and giving\nus the most feasible price on which platform details. With its robust features and intuitive interface, the assistant serves\nas a trusted companion on the journey to finding the perfect product at the best price. By using data aggregation,\n"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "advanced algorithms, and user preferences, it transforms the complex landscape of online retail into a seamless and\nrewarding experience. Moreover, the assistant goes above and beyond to accommodate each user’s particular demands\nand tastes, going above and beyond just comparing prices. It adjusts to different buying patterns with configurable\nsettings and customised recommendations, making sure that every search produces results that cater to the user’s\nparticular preferences and financial limi"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "tations.\nThe Smart Price Comparison Assistant’s capacity to foresee future trends and enhance purchase selections,\nhowever, is what really makes it remarkable. The assistant uses advanced machine learning algorithms to evaluate\nenormous amounts of historical data and forecast price changes. This allows customers to plan their purchases ahead\nof time and take advantage of the best opportunities to make purchases. In essence, the Smart Price Comparison\nAssistant represents a paradigm shift in the "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "way we approach online shopping— It establishes a new benchmark for\n∗Corresponding author\ntarun.22bce8896@vitapstudent.ac.in (T. Sakthivel); krishnan.22bce8879@vitapstudent.ac.in (S. Krishnan);\nemmanuel.22bce8358@vitapstudent.ac.in (J.C. Emmanuel); darshana.22bce7082@vitapstudent.ac.in (D. Sasikumar);\nsanskriti.22bec7135@vitapstudent.ac.in ( Sanskriti)\nORCID(s):\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 1 of 7\nThe Smart Price Comparison Assistant\nintelligent shopping assistants"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": " with its unmatched efficiency, tailored suggestions, and predictive insights, enabling\nusers to buy more wisely, save time, and discover unmatched value in every transaction.\nThe objective of the system we are developing is to enable results which consist of the details of which platform\nor website has less price of that product and how it varies according to the different offers and deals in the upcoming\nmonths.\n2. Contributions\n• We are making a price comparison model that helps with the pric"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "e comparison between the products on different\nwebsites.\n• The price prediction model is used to predict the cost of the product in the future months and how the cost of\nthe product varies.\n• We implement both models on our website which enables us to provide price comparisons and price trend\npredictions.\n3. Related work\n1. Existing mobile shopping assistance applications provide location-based information about stores and promo-\ntions but lack personalization features. Solutions like LiveCompar"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "e and Citi Shopper offer price comparison\nand card-specific deals but fall short of integrating user preferences effectively. Research efforts have explored\ncontext-based mobile shopping applications, focusing on algorithmic approaches for deal ranking and user inter-\nface design for effective presentation. However, challenges persist in delivering personalised recommendations\nthat cater to individual preferences. Our proposed system, myDeal, addresses these gaps by integrating advanced\nalgorith"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ms with user-centric design principles. By considering user preferences, location, and payment cards,\nmyDeal delivers tailored recommendations, overcoming the limitations of existing solutions. The key findings\nhighlight the need for improved personalization in mobile shopping assistance, the ongoing research efforts\nin this direction, and the challenges in effectively integrating user preferences. This research aims to provide\nconsumers with a comprehensive mobile shopping application that opti"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "mises deal selection based on individual\npreferences and context [1].\n2. This study reveals significant insights into online consumer decision-making in Taiwan’s tourism sector,\nparticularly emphasising the crucial role of price. Through extensive interviews, it uncovers widespread online\nprice dispersion, especially within travel agencies. Despite this, consumers may not always secure the best offers\nonline, as prices tend to align with those offered by traditional agencies. The research unders"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "cores the timing\nand impact of price throughout the decision-making process, highlighting its pivotal role in both the initial\nfiltering and final evaluation stages. Furthermore, it contributes to marketing theory by exploring the influence\nof price and cultural diversity on consumer attitudes, offering practical implications for managers navigating the\ncompetitive online marketplace [2].\n3. This research sheds light on the evolving landscape of Internet marketing and e-services, emphasising the"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ir\nstrategic importance for contemporary businesses. It reveals novel insights into online consumer behaviour,\nunderscoring the distinctiveness of traditional markets. Managers demonstrate a keen understanding of consumer\nneeds in the digital realm, effectively harnessing internet capabilities. The study uncovers the interplay between\ninternet development, content, and business strategies, showcasing their pivotal role in driving success. It under-\nscores the necessity for businesses to adopt In"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ternet marketing strategies, particularly highlighting the authors’\ndiscovery of innovative approaches to e-marketing. Additionally, the research advocates for agile adaptation to\nthe digital sphere, leveraging internet technologies to enhance customer interactions and streamline operations\n[3]. In the landscape of online shopping, recent efforts have centred around enhancing user experiences and\nfacilitating informed purchasing decisions. While previous research has primarily focused on persona"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "lised\nadvertising and leveraging user context for targeted promotions, the proposed work introduces a novel approach\nwith a smart price comparison assistant. Unlike traditional methods, which rely on user preferences and location\ndata, this assistant aims to streamline the process of finding the best deals amidst numerous online retailers and\nfluctuating prices. Leveraging advanced algorithms and machine learning models, it offers features such as price\ncomparison, personalised recommendations, "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "and price prediction. This innovative system represents a paradigm\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 2 of 7\nThe Smart Price Comparison Assistant\nshift in online shopping assistance, addressing the challenges of price comparison and prediction in a dynamic\ndigital marketplace.\n4. Proposed work\n1. Data Collection and Integration: The first step involves developing web scraping scripts or utilising APIs\nto collect comprehensive product information, including prices, availa"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "bility, and details, from various online\nretailers. The collected data will be integrated into a centralised database or data repository to ensure seamless\naccess and retrieval during the price comparison process.\n2. Price Comparison: The methodology includes systematically navigating through different websites to extract\nproduct prices from various online shopping platforms. Different organising methods will be employed to\ncategorise and structure the collected prices, facilitating efficient co"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "mparison. To manage the substantial volume\nof data, a specialised tool will be developed to streamline data collection and categorization, ensuring systematic\nretrieval from diverse retailers. The tool will aggregate prices from multiple websites and retailers, providing\nusers with a comprehensive comparison to support informed purchasing decisions.\n3. Price Prediction: Leveraging machine learning models, historical price data will be analysed to identify trends\nand patterns in product pricing. "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "Prediction algorithms will be developed to forecast future price movements based\non historical data, market trends, and other relevant factors. Integration of price prediction capabilities into the\nplatform will empower users with insights into potential price fluctuations, enabling them to make informed\ndecisions and capitalise on favorable pricing trends.\nThe proposed work aims to address the challenges in online shopping by offering a comprehensive platform that\ncombines efficient price compa"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "rison with predictive analytics. Through the integration of advanced technologies\nand methodologies, this research endeavors to provide users with a valuable tool for optimizing their shopping\nexperience and maximizing cost savings.\n5. Methodology\nThis section outlines the methodology of how the flow of the website works. This methodology is split into different\nsections namely,\n• Data Collection and Integration\n– Web scrapping\n– Saving data in the database\n• Price comparison model\n• Price trend"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s prediction model\n• Website\nThe below mentioned image tells us about how the website works..\n5.1. Data Collection and Integration\n5.1.1. Web Scrapping\n[4]Web scraping involves extracting HTML data from URLs for internal use. Since this is a price comparison\nwebsite, data is scraped from multiple e-commerce sites. For this project, scraping is done using PHP libraries for\nparsing HTML pages. With these libraries, product information from various e-commerce sites is scraped and stored\nin the data"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "base.\n5.1.2. Data Integration\nIntegrate the collected data into a centralised database or data repository for easy access and retrieval during price\ncomparison.\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 3 of 7\nThe Smart Price Comparison Assistant\nFigure 1: Workflow of website\n5.2. Price comparison\n• By using web scraping methods, the website consistently collects pricing information from a wide range of\ne-commerce websites, guaranteeing coverage in multiple product categories. "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "In order to keep the data current\nand accurate—which is essential for giving users the most recent pricing insights—regular updates are planned.\n• One important part of the process is data aggregation, which involves combining prices for each product from\nseveral sellers. By providing a thorough comparison, this technique enables consumers to make defensible\nconclusions based on compiled data. In order to ensure consistency and dependability in the comparison results,\nalgorithms are used to reco"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ncile data from various sources. Furthermore, pricing summaries from multiple\nwebsites are produced, allowing consumers to rapidly choose the most affordable options.\n• In order to improve user experience and tool navigation, categorization is essential. Products are divided into\nmany groups according to characteristics like kind, brand, or cost. Product offerings and consumer preferences\nare accommodated via hierarchical classification frameworks, which make browsing and comparison easier.\n• Al"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "gorithms for comparison are created to systematically examine pricing from various vendors. These algorithms\ngive users a comprehensive picture of total costs by accounting for a number of variables, including shipping\ncharges, discounts, and promotions. The goal is to prioritise decision-making simplicity and user experience by\npresenting comparison results in a simple and user-friendly manner.\n• Another important component of the technique is user interface design. Because of the interface’s u"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ser-friendly\ndesign, exploring categories, conducting product searches, and seeing comparative results are all made simple.\nSorting, filtering, and adjustable preferences are examples of features that improve usability and meet a range of\nuser needs.\n5.3. Price Prediction\n• Price Trends and Predictions Machine Learning Models: Train machine learning models using historical price\ndata to identify price trends and patterns. Prediction Algorithms: Develop algorithms to predict future price\nmovement"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s based on historical data, market trends, and other relevant factors.\n• A methodical technique to utilising past price data in conjunction with additional market, economic, and\nsentiment variables is the process of building a price prediction model. After careful preparation of the data\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 4 of 7\nThe Smart Price Comparison Assistant\nto deal with anomalies and missing values, feature engineering is carried out to extract useful features th"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "at are\nuseful for modelling. Selecting the right machine learning algorithms, decision trees, or linear validation metrics\nto make sure they are resilient and generalizable using the prepared dataset.\n• In order to precisely predict future price changes, prediction algorithms are then constructed, including sentiment\nresearch and market patterns. Reliability and real-world application are ensured by continuous monitoring\nand deployment into production systems. Validation techniques, such as sens"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "itivity analysis and out-of-sample\ntesting, verify the model’s stability and generalizability in a range of market scenarios.\n• The goal of this thorough approach is to provide an advanced price prediction model that can effectively guide\nonline shopping investments, improve decision-making procedures, and reduce financial risk in situations with\nfluctuating market conditions.\n• Preprocessing techniques are used to clean and standardise the dataset after data collection, taking care of outliers\n"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "and missing values. The next step is feature engineering, which yields useful predictors for the regression model.\nTo do this, lagged variables are created to record temporal dependencies, technical indicators are calculated to\nmeasure market trends, and sentiment features are extracted to evaluate market sentiment.\n• The selection of suitable regression methods for price prediction tasks is the main focus of model development.\nRegression models such as ridge regression, Lasso regression, or lin"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ear regression are especially appropriate\nbecause pricing data is continuous. Using methods like cross-validation, these models are trained on the prepared\ndataset in order to optimise the model parameters.\n• Model performance is assessed using validation metrics like mean squared error (MSE) or R-squared to make\nsure the selected regression model appropriately depicts price trends and patterns. Furthermore, testing outside\nof the sample is done to evaluate the model’s generalizability to data t"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "hat hasn’t been seen before.\n• The trained regression model is then used as the basis for prediction algorithms, which combine sentiment\nanalysis and market trends to accurately predict future price changes. The model is continuously monitored and\nimproved to guarantee its dependability and efficacy in real-world situations.\n• The goal is to create a reliable and accurate predictive model that may improve investment decision-making\nprocesses and reduce financial risks in dynamic market situation"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s by using this thorough technique that uses\nregression models for price prediction.\n5.4. Website\n• Our website is intricately designed to offer users thorough insights into product pricing across different\ne-commerce platforms. It utilizes web scraping techniques to gather data and employs an advanced price\ncomparison model to highlight the most economical choices.\n• Our website presents users with a concise summary of the price comparison results, displaying the prices offered\nby different ret"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ailers in a clear and organised manner. A comparative table or visual chart may be employed to\njuxtapose prices side-by-side, enabling users to quickly discern the most cost-effective option. Additionally, users\nmay have the option to filter and sort results based on various criteria such as price range, retailer reputation, or\nshipping preferences, further enhancing customization and personalization.\n• Users are presented with comprehensive details about each product in the comparison results, "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "encompassing\nspecifications, features, and images. Additionally, they can access user-generated reviews and ratings, offering\nfurther insights into product performance and customer satisfaction. Direct links to the product pages on relevant\ne-commerce platforms streamline the process from discovering products to making purchases, empowering users\nto make informed decisions effortlessly.\n• The website’s interface is developed using ReactJS framework for the frontend, The backend of the website\nut"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ilizes Node.js as the server-side runtime environment, allowing developers to write server-side scripts in\nJavaScript for consistent development. Express.js, a web application framework for Node.js is employed to\nstreamline the creation of server-side logic and APIs and for the database the website uses mongodb . To simplify\ninteractions with MongoDB, Mongoose, an Object Data Modeling (ODM) library for MongoDB is used .\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 5 of 7\nThe Smart"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": " Price Comparison Assistant\n6. Result and comparisons:\nModels used\n1. Regression Models: Regression models can be used to predict product prices based on features such as product\nattributes, brand, and historical price data. Techniques like linear regression or ensemble methods such as random\nforests can be effective for this task.\nFigure 2: Working of linear regression\n2. Clustering and Classification: Clustering algorithms can help in grouping similar products together, while\nclassification al"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "gorithms can be used for tasks such as categorising products into different types or identifying\noutliers .\n3. Understanding Regression for Price Prediction using regression:\nRegression analysis is a statistical method used to model the relationship between a dependent variable (in this\ncase, the price of a product) and one or more independent variables (such as product features, brand, and historical\nprice data). In the context of building a price prediction model for a price comparison tool, r"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "egression serves as\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 6 of 7\nThe Smart Price Comparison Assistant\na fundamental technique for estimating the price of a product based on its relevant attributes. The fundamental\nformulae for basic linear regression model is :\n𝑌= 𝛽0 + 𝛽1𝑋+ 𝜀\n(1)\nIn the context of the provided information: Where,\n• 𝑌denotes the dependent variable (price),\n• 𝑋signifies the independent variable (product attribute),\n• 𝛽0 represents the intercept,\n• 𝛽1 denotes "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "the coefficient of the independent variable,\n• 𝜀symbolises the error term.\n[5] The initial step is to convert raw data into processed data. Which is done by data cleaning since the raw data\ncollected has multiple attributes, but only some of those attributes are needed for the prediction. Then, in feature\nextraction, the data set is divided into two subsets. Training Set and Test Set The training set is used to train a\nmodel, while the testing set is used to test the trained model. After preproc"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "essing, we are going to analyse the\ndata using LSTM and LMS algorithms. Next, we get the output in the form of a report and graph format.\nOnce the regression model is trained on historical data, it is evaluated using various metrics such as Mean\nSquared Error (MSE), Root Mean Squared Error (RMSE), Mean Absolute Error (MAE), or R-squared (R2)\nvalue. These metrics quantify how well the model fits the observed data and how accurately it predicts prices\nfor unseen data.\n7. Conclusion:\nThe emergence "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "of smart price comparison assistants revolutionises online shopping, offering users efficient access\nto the best deals across multiple retailers. Through AI-driven recommendation engines and data analysis, these\nassistants provide personalised suggestions, empowering users with informed purchasing decisions. Our proposed\nmethodology, encompassing data collection, price comparison, and prediction, ensures the reliability and effectiveness\nof our price comparison assistant. By integrating advanced"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": " techniques such as web scraping and regression models,\nwe enable users to make proactive purchasing decisions based on both current prices and future trends. In essence,\nthe Smart Price Comparison Assistant represents a paradigm shift inconsumer empowerment within the digital\nmarketplace. It not only facilitates immediate price comparisons but also empowers users to anticipate future trends,\nensuring a more efficient and rewarding online shopping experience. Moving forward, our research continu"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "es to drive\nadvancements in e-commerce, placing users at the forefront of the digital marketplace with the tools and insights\nneeded to navigate it with confidence and ease.\nReferences\n[1] C.-Y. C. Chang, Does price matter? how price influences online consumer decision making, Japanese Journal of Administrative Science 22 (3)\n(2009) 245–254.\n[2] H. Terziu, The role of the internet in the development of marketing and electronic services in business, European Journal of Economics and\nBusiness Stud"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ies (2021).\n[3] K. Muralidharan, S. Gottipati, J. Jiang, N. Ramasubbu, R. K. Balan, mydeal: A mobile shopping assistant matching user preferences\nto promotions, MOBIQUITOUS ’14: Proceedings of the 11th International Conference on Mobile and Ubiquitous Systems: Computing,\nNetworking and Services (2014) 238–247.\n[4] A. Shaikh, R. Khan, K. Panokher, M. Ranjan, V. Sonaje, E-commerce price comparison website using web scraping, International Journal of\nInnovative Research in Engineering & Multidiscip"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "linary Physical Sciences 11 (2023) 1–13. doi:10.37082/IJIRMPS.v11.i3.230223.\n[5] S. Ashika, A. Shet, D. Naik, S. Shetty, R. Kulkarni, Stock price prediction using ml techniques, International Research Journal of Engineering\nand Technology (IRJET) 09 (01) (2022) 1639–1642.\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 7 of 7\n"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "Intelligent Shopping Made Simple: The Smart Price Comparison\nAssistant\nTarun Sakthivela, Sabari Krishnana, Jotham Cheeran Emmanuela, Darshana Sasikumara and\nSanskritia\naDepartment of Computer Science and Engineering, VIT AP UNIVERSITY, Amaravathi, Vijayawada, 522241, Andhra Pradesh, India\nA R T I C L E I N F O\nKeywords:\n\" \" Intelligent\nShopping\nMade\nSimple:\nThe\nSmart Price Comparison Assistant\nA B S T R A C T\nIn the era of online shopping, finding the best deals on products can be a daunting tas"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "k. With so\nmany online retailers offering similar products at different prices, it can be time-consuming and\noverwhelming to compare prices across multiple websites manually. That’s where a smart price\ncomparison assistant comes in handy. By utilising AI technology, this assistant can automatically\nsearch and compare prices from various online retailers, saving users time and effort. With\nthe ability to analyse data and identify the best deals, a smart price comparison assistant can\nprovide user"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s with a comprehensive and unbiased view of the market. This allows users to\nmake informed purchasing decisions and ensures that they are getting the best value for their\nmoney. By utilising AI-driven recommendation engines, this price comparison assistant can not\nonly compare prices but also provide personalised recommendations based on user preferences\nand previous purchases. By using personalised shopping powered by AI, businesses can offer\ntheir customers a unique and tailored experience. Th"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "is personalised experience leads to higher\nengagement, loyalty, and ultimately, increased revenue for businesses. In addition to personalised\nshopping, AI-driven product recommendations also play a significant role in creating engaging\nand personalised online shopping experiences. With the help of AI-powered personalization\ntools, the smart price comparison assistant can analyse user behaviour and preferences to\npersonalise search results and provide relevant and accurate product recommendations"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": ".\n1. Introduction\nIn online shopping, offers unparalleled convenience and endless options, consumers are often faced with the\ndaunting task of navigating through countless retailers and fluctuating prices to find the best deals on their desired\nproducts. Also, people who do shopping through online shopping may miss the major deals or offers of the product\nwhich they are searching for. They didn’t know about the offer since they didn’t go through all the websites or the offers\nthat were running t"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "hrough at that time. The Smart Price Comparison Assistant emerges as a beacon of efficiency and\nintelligence in this bustling digital marketplace.\nThis tool helps in surfing the same product on various websites and then comparing the prices of them and giving\nus the most feasible price on which platform details. With its robust features and intuitive interface, the assistant serves\nas a trusted companion on the journey to finding the perfect product at the best price. By using data aggregation,\n"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "advanced algorithms, and user preferences, it transforms the complex landscape of online retail into a seamless and\nrewarding experience. Moreover, the assistant goes above and beyond to accommodate each user’s particular demands\nand tastes, going above and beyond just comparing prices. It adjusts to different buying patterns with configurable\nsettings and customised recommendations, making sure that every search produces results that cater to the user’s\nparticular preferences and financial limi"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "tations.\nThe Smart Price Comparison Assistant’s capacity to foresee future trends and enhance purchase selections,\nhowever, is what really makes it remarkable. The assistant uses advanced machine learning algorithms to evaluate\nenormous amounts of historical data and forecast price changes. This allows customers to plan their purchases ahead\nof time and take advantage of the best opportunities to make purchases. In essence, the Smart Price Comparison\nAssistant represents a paradigm shift in the "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "way we approach online shopping— It establishes a new benchmark for\n∗Corresponding author\ntarun.22bce8896@vitapstudent.ac.in (T. Sakthivel); krishnan.22bce8879@vitapstudent.ac.in (S. Krishnan);\nemmanuel.22bce8358@vitapstudent.ac.in (J.C. Emmanuel); darshana.22bce7082@vitapstudent.ac.in (D. Sasikumar);\nsanskriti.22bec7135@vitapstudent.ac.in ( Sanskriti)\nORCID(s):\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 1 of 7\nThe Smart Price Comparison Assistant\nintelligent shopping assistants"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": " with its unmatched efficiency, tailored suggestions, and predictive insights, enabling\nusers to buy more wisely, save time, and discover unmatched value in every transaction.\nThe objective of the system we are developing is to enable results which consist of the details of which platform\nor website has less price of that product and how it varies according to the different offers and deals in the upcoming\nmonths.\n2. Contributions\n• We are making a price comparison model that helps with the pric"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "e comparison between the products on different\nwebsites.\n• The price prediction model is used to predict the cost of the product in the future months and how the cost of\nthe product varies.\n• We implement both models on our website which enables us to provide price comparisons and price trend\npredictions.\n3. Related work\n1. Existing mobile shopping assistance applications provide location-based information about stores and promo-\ntions but lack personalization features. Solutions like LiveCompar"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "e and Citi Shopper offer price comparison\nand card-specific deals but fall short of integrating user preferences effectively. Research efforts have explored\ncontext-based mobile shopping applications, focusing on algorithmic approaches for deal ranking and user inter-\nface design for effective presentation. However, challenges persist in delivering personalised recommendations\nthat cater to individual preferences. Our proposed system, myDeal, addresses these gaps by integrating advanced\nalgorith"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ms with user-centric design principles. By considering user preferences, location, and payment cards,\nmyDeal delivers tailored recommendations, overcoming the limitations of existing solutions. The key findings\nhighlight the need for improved personalization in mobile shopping assistance, the ongoing research efforts\nin this direction, and the challenges in effectively integrating user preferences. This research aims to provide\nconsumers with a comprehensive mobile shopping application that opti"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "mises deal selection based on individual\npreferences and context [1].\n2. This study reveals significant insights into online consumer decision-making in Taiwan’s tourism sector,\nparticularly emphasising the crucial role of price. Through extensive interviews, it uncovers widespread online\nprice dispersion, especially within travel agencies. Despite this, consumers may not always secure the best offers\nonline, as prices tend to align with those offered by traditional agencies. The research unders"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "cores the timing\nand impact of price throughout the decision-making process, highlighting its pivotal role in both the initial\nfiltering and final evaluation stages. Furthermore, it contributes to marketing theory by exploring the influence\nof price and cultural diversity on consumer attitudes, offering practical implications for managers navigating the\ncompetitive online marketplace [2].\n3. This research sheds light on the evolving landscape of Internet marketing and e-services, emphasising the"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ir\nstrategic importance for contemporary businesses. It reveals novel insights into online consumer behaviour,\nunderscoring the distinctiveness of traditional markets. Managers demonstrate a keen understanding of consumer\nneeds in the digital realm, effectively harnessing internet capabilities. The study uncovers the interplay between\ninternet development, content, and business strategies, showcasing their pivotal role in driving success. It under-\nscores the necessity for businesses to adopt In"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ternet marketing strategies, particularly highlighting the authors’\ndiscovery of innovative approaches to e-marketing. Additionally, the research advocates for agile adaptation to\nthe digital sphere, leveraging internet technologies to enhance customer interactions and streamline operations\n[3]. In the landscape of online shopping, recent efforts have centred around enhancing user experiences and\nfacilitating informed purchasing decisions. While previous research has primarily focused on persona"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "lised\nadvertising and leveraging user context for targeted promotions, the proposed work introduces a novel approach\nwith a smart price comparison assistant. Unlike traditional methods, which rely on user preferences and location\ndata, this assistant aims to streamline the process of finding the best deals amidst numerous online retailers and\nfluctuating prices. Leveraging advanced algorithms and machine learning models, it offers features such as price\ncomparison, personalised recommendations, "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "and price prediction. This innovative system represents a paradigm\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 2 of 7\nThe Smart Price Comparison Assistant\nshift in online shopping assistance, addressing the challenges of price comparison and prediction in a dynamic\ndigital marketplace.\n4. Proposed work\n1. Data Collection and Integration: The first step involves developing web scraping scripts or utilising APIs\nto collect comprehensive product information, including prices, availa"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "bility, and details, from various online\nretailers. The collected data will be integrated into a centralised database or data repository to ensure seamless\naccess and retrieval during the price comparison process.\n2. Price Comparison: The methodology includes systematically navigating through different websites to extract\nproduct prices from various online shopping platforms. Different organising methods will be employed to\ncategorise and structure the collected prices, facilitating efficient co"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "mparison. To manage the substantial volume\nof data, a specialised tool will be developed to streamline data collection and categorization, ensuring systematic\nretrieval from diverse retailers. The tool will aggregate prices from multiple websites and retailers, providing\nusers with a comprehensive comparison to support informed purchasing decisions.\n3. Price Prediction: Leveraging machine learning models, historical price data will be analysed to identify trends\nand patterns in product pricing. "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "Prediction algorithms will be developed to forecast future price movements based\non historical data, market trends, and other relevant factors. Integration of price prediction capabilities into the\nplatform will empower users with insights into potential price fluctuations, enabling them to make informed\ndecisions and capitalise on favorable pricing trends.\nThe proposed work aims to address the challenges in online shopping by offering a comprehensive platform that\ncombines efficient price compa"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "rison with predictive analytics. Through the integration of advanced technologies\nand methodologies, this research endeavors to provide users with a valuable tool for optimizing their shopping\nexperience and maximizing cost savings.\n5. Methodology\nThis section outlines the methodology of how the flow of the website works. This methodology is split into different\nsections namely,\n• Data Collection and Integration\n– Web scrapping\n– Saving data in the database\n• Price comparison model\n• Price trend"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s prediction model\n• Website\nThe below mentioned image tells us about how the website works..\n5.1. Data Collection and Integration\n5.1.1. Web Scrapping\n[4]Web scraping involves extracting HTML data from URLs for internal use. Since this is a price comparison\nwebsite, data is scraped from multiple e-commerce sites. For this project, scraping is done using PHP libraries for\nparsing HTML pages. With these libraries, product information from various e-commerce sites is scraped and stored\nin the data"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "base.\n5.1.2. Data Integration\nIntegrate the collected data into a centralised database or data repository for easy access and retrieval during price\ncomparison.\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 3 of 7\nThe Smart Price Comparison Assistant\nFigure 1: Workflow of website\n5.2. Price comparison\n• By using web scraping methods, the website consistently collects pricing information from a wide range of\ne-commerce websites, guaranteeing coverage in multiple product categories. "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "In order to keep the data current\nand accurate—which is essential for giving users the most recent pricing insights—regular updates are planned.\n• One important part of the process is data aggregation, which involves combining prices for each product from\nseveral sellers. By providing a thorough comparison, this technique enables consumers to make defensible\nconclusions based on compiled data. In order to ensure consistency and dependability in the comparison results,\nalgorithms are used to reco"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ncile data from various sources. Furthermore, pricing summaries from multiple\nwebsites are produced, allowing consumers to rapidly choose the most affordable options.\n• In order to improve user experience and tool navigation, categorization is essential. Products are divided into\nmany groups according to characteristics like kind, brand, or cost. Product offerings and consumer preferences\nare accommodated via hierarchical classification frameworks, which make browsing and comparison easier.\n• Al"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "gorithms for comparison are created to systematically examine pricing from various vendors. These algorithms\ngive users a comprehensive picture of total costs by accounting for a number of variables, including shipping\ncharges, discounts, and promotions. The goal is to prioritise decision-making simplicity and user experience by\npresenting comparison results in a simple and user-friendly manner.\n• Another important component of the technique is user interface design. Because of the interface’s u"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ser-friendly\ndesign, exploring categories, conducting product searches, and seeing comparative results are all made simple.\nSorting, filtering, and adjustable preferences are examples of features that improve usability and meet a range of\nuser needs.\n5.3. Price Prediction\n• Price Trends and Predictions Machine Learning Models: Train machine learning models using historical price\ndata to identify price trends and patterns. Prediction Algorithms: Develop algorithms to predict future price\nmovement"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s based on historical data, market trends, and other relevant factors.\n• A methodical technique to utilising past price data in conjunction with additional market, economic, and\nsentiment variables is the process of building a price prediction model. After careful preparation of the data\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 4 of 7\nThe Smart Price Comparison Assistant\nto deal with anomalies and missing values, feature engineering is carried out to extract useful features th"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "at are\nuseful for modelling. Selecting the right machine learning algorithms, decision trees, or linear validation metrics\nto make sure they are resilient and generalizable using the prepared dataset.\n• In order to precisely predict future price changes, prediction algorithms are then constructed, including sentiment\nresearch and market patterns. Reliability and real-world application are ensured by continuous monitoring\nand deployment into production systems. Validation techniques, such as sens"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "itivity analysis and out-of-sample\ntesting, verify the model’s stability and generalizability in a range of market scenarios.\n• The goal of this thorough approach is to provide an advanced price prediction model that can effectively guide\nonline shopping investments, improve decision-making procedures, and reduce financial risk in situations with\nfluctuating market conditions.\n• Preprocessing techniques are used to clean and standardise the dataset after data collection, taking care of outliers\n"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "and missing values. The next step is feature engineering, which yields useful predictors for the regression model.\nTo do this, lagged variables are created to record temporal dependencies, technical indicators are calculated to\nmeasure market trends, and sentiment features are extracted to evaluate market sentiment.\n• The selection of suitable regression methods for price prediction tasks is the main focus of model development.\nRegression models such as ridge regression, Lasso regression, or lin"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ear regression are especially appropriate\nbecause pricing data is continuous. Using methods like cross-validation, these models are trained on the prepared\ndataset in order to optimise the model parameters.\n• Model performance is assessed using validation metrics like mean squared error (MSE) or R-squared to make\nsure the selected regression model appropriately depicts price trends and patterns. Furthermore, testing outside\nof the sample is done to evaluate the model’s generalizability to data t"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "hat hasn’t been seen before.\n• The trained regression model is then used as the basis for prediction algorithms, which combine sentiment\nanalysis and market trends to accurately predict future price changes. The model is continuously monitored and\nimproved to guarantee its dependability and efficacy in real-world situations.\n• The goal is to create a reliable and accurate predictive model that may improve investment decision-making\nprocesses and reduce financial risks in dynamic market situation"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "s by using this thorough technique that uses\nregression models for price prediction.\n5.4. Website\n• Our website is intricately designed to offer users thorough insights into product pricing across different\ne-commerce platforms. It utilizes web scraping techniques to gather data and employs an advanced price\ncomparison model to highlight the most economical choices.\n• Our website presents users with a concise summary of the price comparison results, displaying the prices offered\nby different ret"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ailers in a clear and organised manner. A comparative table or visual chart may be employed to\njuxtapose prices side-by-side, enabling users to quickly discern the most cost-effective option. Additionally, users\nmay have the option to filter and sort results based on various criteria such as price range, retailer reputation, or\nshipping preferences, further enhancing customization and personalization.\n• Users are presented with comprehensive details about each product in the comparison results, "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "encompassing\nspecifications, features, and images. Additionally, they can access user-generated reviews and ratings, offering\nfurther insights into product performance and customer satisfaction. Direct links to the product pages on relevant\ne-commerce platforms streamline the process from discovering products to making purchases, empowering users\nto make informed decisions effortlessly.\n• The website’s interface is developed using ReactJS framework for the frontend, The backend of the website\nut"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ilizes Node.js as the server-side runtime environment, allowing developers to write server-side scripts in\nJavaScript for consistent development. Express.js, a web application framework for Node.js is employed to\nstreamline the creation of server-side logic and APIs and for the database the website uses mongodb . To simplify\ninteractions with MongoDB, Mongoose, an Object Data Modeling (ODM) library for MongoDB is used .\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 5 of 7\nThe Smart"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": " Price Comparison Assistant\n6. Result and comparisons:\nModels used\n1. Regression Models: Regression models can be used to predict product prices based on features such as product\nattributes, brand, and historical price data. Techniques like linear regression or ensemble methods such as random\nforests can be effective for this task.\nFigure 2: Working of linear regression\n2. Clustering and Classification: Clustering algorithms can help in grouping similar products together, while\nclassification al"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "gorithms can be used for tasks such as categorising products into different types or identifying\noutliers .\n3. Understanding Regression for Price Prediction using regression:\nRegression analysis is a statistical method used to model the relationship between a dependent variable (in this\ncase, the price of a product) and one or more independent variables (such as product features, brand, and historical\nprice data). In the context of building a price prediction model for a price comparison tool, r"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "egression serves as\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 6 of 7\nThe Smart Price Comparison Assistant\na fundamental technique for estimating the price of a product based on its relevant attributes. The fundamental\nformulae for basic linear regression model is :\n𝑌= 𝛽0 + 𝛽1𝑋+ 𝜀\n(1)\nIn the context of the provided information: Where,\n• 𝑌denotes the dependent variable (price),\n• 𝑋signifies the independent variable (product attribute),\n• 𝛽0 represents the intercept,\n• 𝛽1 denotes "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "the coefficient of the independent variable,\n• 𝜀symbolises the error term.\n[5] The initial step is to convert raw data into processed data. Which is done by data cleaning since the raw data\ncollected has multiple attributes, but only some of those attributes are needed for the prediction. Then, in feature\nextraction, the data set is divided into two subsets. Training Set and Test Set The training set is used to train a\nmodel, while the testing set is used to test the trained model. After preproc"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "essing, we are going to analyse the\ndata using LSTM and LMS algorithms. Next, we get the output in the form of a report and graph format.\nOnce the regression model is trained on historical data, it is evaluated using various metrics such as Mean\nSquared Error (MSE), Root Mean Squared Error (RMSE), Mean Absolute Error (MAE), or R-squared (R2)\nvalue. These metrics quantify how well the model fits the observed data and how accurately it predicts prices\nfor unseen data.\n7. Conclusion:\nThe emergence "
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "of smart price comparison assistants revolutionises online shopping, offering users efficient access\nto the best deals across multiple retailers. Through AI-driven recommendation engines and data analysis, these\nassistants provide personalised suggestions, empowering users with informed purchasing decisions. Our proposed\nmethodology, encompassing data collection, price comparison, and prediction, ensures the reliability and effectiveness\nof our price comparison assistant. By integrating advanced"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": " techniques such as web scraping and regression models,\nwe enable users to make proactive purchasing decisions based on both current prices and future trends. In essence,\nthe Smart Price Comparison Assistant represents a paradigm shift inconsumer empowerment within the digital\nmarketplace. It not only facilitates immediate price comparisons but also empowers users to anticipate future trends,\nensuring a more efficient and rewarding online shopping experience. Moving forward, our research continu"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "es to drive\nadvancements in e-commerce, placing users at the forefront of the digital marketplace with the tools and insights\nneeded to navigate it with confidence and ease.\nReferences\n[1] C.-Y. C. Chang, Does price matter? how price influences online consumer decision making, Japanese Journal of Administrative Science 22 (3)\n(2009) 245–254.\n[2] H. Terziu, The role of the internet in the development of marketing and electronic services in business, European Journal of Economics and\nBusiness Stud"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "ies (2021).\n[3] K. Muralidharan, S. Gottipati, J. Jiang, N. Ramasubbu, R. K. Balan, mydeal: A mobile shopping assistant matching user preferences\nto promotions, MOBIQUITOUS ’14: Proceedings of the 11th International Conference on Mobile and Ubiquitous Systems: Computing,\nNetworking and Services (2014) 238–247.\n[4] A. Shaikh, R. Khan, K. Panokher, M. Ranjan, V. Sonaje, E-commerce price comparison website using web scraping, International Journal of\nInnovative Research in Engineering & Multidiscip"
  },
  {
    "source_file": "Intelligent Shopping Made Simple.pdf",
    "chunk": "linary Physical Sciences 11 (2023) 1–13. doi:10.37082/IJIRMPS.v11.i3.230223.\n[5] S. Ashika, A. Shet, D. Naik, S. Shetty, R. Kulkarni, Stock price prediction using ml techniques, International Research Journal of Engineering\nand Technology (IRJET) 09 (01) (2022) 1639–1642.\nSabari krishnan et al.: Preprint submitted to Elsevier\nPage 7 of 7\n"
  }
]